var SCRIPTURES = {
    "шветашватара упанишад": "Шветашватара-упанишад",
    "бхакти расамрита синдху": "Бхакти-расамрита-синдху",
    "веданта сутра": "Веданта-сутра",
    "ману самхита": "Ману-самхита",
    "шримад бхагаватам": "Шримад-Бхагаватам",
    "бхагавад гита": "Бхагавад-гита",
    "бхагавад гиты": "Бхагавад-гита",
    "бхагавад гите": "Бхагавад-гита",
    // remove shri ?
    "шри шикшаштакам": "Шри Шикшаштакам",
    "гита говинда": "Шри Гита-Говинда",
    // remove shri ?
    "шри шикшаштака": "Шри Шикшаштакам",
    "риг веда": "Риг-веда",
    "брахма самхита": "Шри Брахма-самхита",
    "гита мала": "Гита-мала",
    "катха упанишад": "Катха-упанишад",
    "бхакти сандарбха": "Бхакти-сандарбха",
    "таттва сандарбха": "Таттва-сандарбха",
    "бхагавад сандарбха": "Бхагавад-сандарбха",
    "хитопадеша": "Хитопадеша",
    "шад госвами аштака": "Шад-Госвами-аштака",
    "чайтанья чаритамрита антья": "«Шри Чайтанья-чаритамрита», Антья-лила",
    "чайтанья чаритамрита мадхья": "«Шри Чайтанья-чаритамрита», Мадхья-лила",
    "чайтанья чаритамрита ади": "«Шри Чайтанья-чаритамрита», Ади-лила",
    "чайтанья чаритамрите антья": "«Шри Чайтанья-чаритамрита», Антья-лила",
    "чайтанья чаритамрите мадхья": "«Шри Чайтанья-чаритамрита», Мадхья-лила",
    "чайтанья чаритамрите ади": "«Шри Чайтанья-чаритамрита», Ади-лила",
    "чайтанья чаритамриты антья": "«Шри Чайтанья-чаритамрита», Антья-лила",
    "чайтанья чаритамриты мадхья": "«Шри Чайтанья-чаритамрита», Мадхья-лила",
    "чайтанья чаритамриты ади": "«Шри Чайтанья-чаритамрита», Ади-лила",
    "чайтанья чаритамриту антья": "«Шри Чайтанья-чаритамрита», Антья-лила",
    "чайтанья чаритамриту мадхья": "«Шри Чайтанья-чаритамрита», Мадхья-лила",
    "чайтанья чаритамриту ади": "«Шри Чайтанья-чаритамрита», Ади-лила",
    "поиск шри кришны": "Поиск Шри Кришны",
    "падьявали": "Падьявали",
    "гоптритве варана": "Гоптритве варана",
    "шаранагати": "Шаранагати", // 1
    "вилапа кусуманджали": "Шри Вилапа-кусуманджали",
    // parsing problem
    "вилāпа кусумāн̃джали": "Шри Вилапа-кусуманджали",
    "шри кришнера аштоттара шата нама": "Шри Шри Кришнера аштоттара-шата-нама",
    "бхаджана рахасья вритти": "Бхаджана-рахасья-вритти",
    "према виварта": "Према-виварта",
    "падма пурана уттара кханда": "«Падма-пурана», Уттара-кханда",
    "према дхама дева стотрам": "Према-Дхама-Дева-стотрам",
    "гитамала ямуна бхававали": "«Гитамала», Ямуна-бхававали",
    "радха раса судха нидхи": "Радха-раса-судха-нидхи",
    "шри гуру парампара": "Шри Гуру-парампара",

    "чайтанья бхагавата мадхья": "«Шри Чайтанья Бхагавата», Мадхья-кханда",
    "чайтанья бхагавата антья": "«Шри Чайтанья Бхагавата», Антья-кханда",
    "чайтанья бхагавата ади": "«Шри Чайтанья Бхагавата», Ади-кханда",
    "чайтанья бхагаваты мадхья": "«Шри Чайтанья Бхагавата», Мадхья-кханда",
    "чайтанья бхагаваты антья": "«Шри Чайтанья Бхагавата», Антья-кханда",
    "чайтанья бхагаваты ади": "«Шри Чайтанья Бхагавата», Ади-кханда",
    "лалита аштака": "Шри Лалита-аштака",
    "шри дайита даса пранати панчакам": "Шри Дайита Даса Пранати Панчакам",
    "дайита дас дашакам": "Шри Шри Дайита Дас Дашакам",
    "прабхупада падма ставаках": "Шри Шри Прабхупада-падма Ставаках",
    "шриман нитьянанда двадашакам": "Шриман Нитьянанда Двадашакам",
    "нитай гунамани амара": "Нитай гунамани амара",
    "шримад бхактивинода вираха дашакам": "Шримад Бхактивинода-вираха Дашакам",
    "гитавали": "Гитавали",
    "шри шри прапанна дживанамритам": "Шри Шри Прапанна-дживанамритам",
    // "прартхана": "Прартхана",
    "сарвасва томара": "Сарвасва томара",
    "гитамахатмйам": "Гитамахатмйам",
    "гурваштака": "Шри Гурваштака",
    "ишопанишад": "Шри Ишопанишад",
    "прартханашрая чатурдашака": "Шри Прартханашрая-чатурдашака",
    "манах шикша": "Манах-шикша",
    "манах̣ ш́икш̣а̄": "Манах-шикша",
    "бхакти сандрарбха": "Бхакти-сандрарбха",
    "бхакти сандрарбхе": "Бхакти-сандрарбха",
    "вайшнава ке": "Вайшнава ке",
    "мундака упанишад": "Мундака Упанишад",
    "таиттирия упанишад": "Таиттирия-упанишад",
    "махабхарата ади парва": "«Махабхарата», Ади-парва",
    "махабхарата удьога парва": "«Махабхарата», Удьога-парва",
    "анйа абхилаша чхади": "Анйа-абхилаша чхади",
    "анйа абхила̄ш̣а чха̄д̣и": "Анйа-абхилаша чхади",
    "джайва дхарма": "Джайва-дхарма",
    "джайва дхарме": "Джайва-дхарма",
    "ари бхакти виласа": "Хари-бхакти-виласа",
    "брихан нарадия пурана": "Брихан-нарадия-пурана",
    "катха упанишада": "Катха-Упанишада",
    "чхандогья упанишада": "Чхандогья-упанишада",
    "шветашватара упанишада": "Шветашватара-упанишада",
    "чайтанья чандрамрита": "Чайтанья-чандрамрита",
    "мукта чаритра": "Мукта Чаритра",
    "кальяна калпатару": "Кальяна-калпатару",
    "враджа виласа става": "Враджа-виласа-става",
    "шад госвами аштакам": "Шри Шад Госвами Аштакам",
    "кришна карнамрита": "Кришна-карнамрита",
    "брихад бхагаватамрита": "Брихад Бхагаватамрита",
    "брихад бхагаватамритам": "Брихад Бхагаватамрита",
    
    "намаштакам": "Намаштакам",
    "прартхана лаласа": "«Прартхана», Лаласа",
    "шри дана кели чинтамани": "Шри Дана-кели Чинтамани",
    "шри лалита аштакам": "Шри Лалита-аштакам",
    "упадешамрита": "Шри Упадешамрита",
    "даинйа прартхана гити": "Даинйа Прартхана Гити",
    "кабе муи вайшнава чинибо": "Кабе муи вайшнава чинибо",
    "шримад гауракишора намаскара дашакам": "Шри Шримад Гауракишора-намаскара Дашакам",
    "рупануга махатмья": "Шри рупануга-махатмья",
    "акродха парамананда": "Акродха парамананда",
    "джанама сапхала тара": "Джанама сапхала тара",
    "радхаштака": "Шри Радхаштака",
    "бхаджана лаласа": "Бхаджана-лаласа",
    "чайтаньяштака": "Шри Чайтаньяштака",
    "кали гхора тимире": "Кали-гхора тимире",
    "ригведа": "Ригведа",
    "кабе шри чаитанйа море корибена дойа": "Кабе шри чаитанйа море корибена дойа",
    "гауранга каруна коро": "Гауранга каруна коро",
    "нитай пада камала": "Нитай-Пада-Камала",
    "рагхувамша": "Рагхувамша",
    "вишну пурана": "Вишну-пурана",
    "виш̣н̣у пура̄н̣а": "Вишну-пурана",
    "мангалачарана": "Мангалачарана",
    "наваграха стотра": "Наваграха стотра",
    "нама санкиртан": "Нама-санкиртан",
    "слово хранителя преданности": "Слово Хранителя Преданности",
    "ачарья вандана": "Ачарья вандана",
    "а̄ча̄рйа вандана": "Ачарья вандана",
    "шри нама": "Шри Нама",
    "шуддха бхаката": "Шуддха-бхаката",
    "манаса дехо гехо": "Манаса дехо гехо",
    "саи кева сунаило шйама нама": "Саи, Кева Сунаило Шйама-нама",
    "даинья прапатти": "Даинья о прапатти",  
    "ману смрити": "Ману-смрити",
    "шри прартхана": "Шри Прартхана",
    "атма самарпане": "Атма-самарпане",
    "ш́рӣ кр̣ш̣н̣ера вим̇соттара ш́ата на̄ма": "Ш́рӣ Кр̣ш̣н̣ера Вим̇соттара-ш́ата-на̄ма",
    "чаураграганья пуруша аштака": "Шри Чаураграганья-пуруша-аштака",
    "радха бхаджана махима": "Шри Радха-бхаджана махима",
    "хари бхакти виласа прабхаса кханда": "«Хари-бхакти-виласа», Прабхаса-кханда",
    "пратхама йама садхана шраддха": "Пратхама-йама садхана - Шраддха",
    // "": "",
    // "": "",

    //---
    "тайттирия упанишад": "Тайттирия-упанишад",
    "чхандогья упанишад": "Чхандогья-упанишад"
    
};

// TODO:
// multi
// *нахи джанамало наме анурага мора / бхактивинода-читта духкхе бибхора* — «У меня никогда не было никакой привязанности к Святым Именам! Поэтому сердце Бхактивинода полно скорби!» (Шрила Бхактивинод Тхакур, «Шри Шикшаштакам», (цикл песен), второй стих, песня вторая, 5).
// *пашу-пакши хойе тхаки сварге ба ниройе / таба бхакти раху бхактивинода-хридойе* — «Буду ли я птицей или зверем, буду жить в раю или аду, позволь непритязательному Бхактивиноду всегда лелеять в глубине своего сердца преданность Тебе!» (Шрила Бхактивинод Тхакур, «Шри Шикшаштакам» (цикл песен), четвертый стих, песня четвертая, 7).
// *вичакшана кори’, декхите чахиле, хойа анкхи-агочара / пунах нахи декхи’, кандайе парана, духкхера нахи тхаке ора* — «Стоит мне пожелать увидеть Его ближе, как вдруг Он становится невидимым! Не видя Его, моя душа плачет, и моему горю нет ни конца, ни края» («Гитавали», Шрила Бхактивинода Тхакур, Раздел 12 — «Шри Шикшаштака», Бенгальские песни, основанные на «Шикшаштаке» Шри Чайтаньи Махапрабху, Песня 8-1, стих 2).
// «Вобрав в себя чистые золотистые воды реки Джамбу, воспетой в «Шримад-Бхагаватам», не воспарило ли это золотое облако на гору, куда снизошла золотая луна (Шри Гаурачандра), чтобы пролить потоки дождя на все окрестности, поглощенные лесным пожаром (тройственных страданий), а затем неожиданно скрылось в пыли земли на месте явления Шри Гауранги? О Дина-наяна, где бы ни находилась эта великая душа, молю, скорей отведи этого слугу к ней!» (Шрила Шридхар Махарадж, «Шри Дайита Дас Дашакам, 5).
// «Вишванатх Чакраварти Тхакур стал *шикша-гуру* [наставляющим духовным учителем] Баладева Видьябхушана, которому раскрыл знание «Шримад-Бхагаватам». После Шри Баладева Видьябхушана самым выдающимся *ачарьей* стал Джаганнатх Дас Бабаджи, которого Шри Бхактивинод Тхакур принял своим *шикша-гуру*. Близким другом и спутником Бхактивинода Тхакура был знаменитый *маха-бхагавата-вайшнав* Шри Гауракишор Дас Бабаджи, черпающий единственную радость в *Хари-бхаджане*.» (Шрила Бхактисиддханта Сарасвати Госвами Прабхупада, Шри Гуру-парампара, 8).
// «Тхакур Вриндаван дас описал игры Господа Чайтаньи, подобно тому как Вьясадева описал все игры Господа Кришны в «Шримад-Бхагаватам»» («Шри Чайтанья-чаритамрита», Ади-лила, 8.34).
// [Рамананда Рай продолжает:] «Те, кто, даже держась за свое прочное социальное положение, отбрасывают процесс умозрительного познания и своими телом, словами и умом выказывают все почтение описаниям Твоей Личности и деяний, посвящая свои жизни этим рассказам, которые произносишь Ты сам и Твои чистые преданные, несомненно побеждают Твою Светлость, хотя в других случаях Тебя не одолеть никому в трех мирах» («Шримад-Бхагаватам», 10,14.3; стих приводится также в «Шри Чайтанья-чаритамрите», Мадхья-лила, 8.67).
// «На берегу бескрайнего синего океана Гададхар Пандит читал Шри Чайтанье Махапрабху, мучимому великой внутренней болью разлуки с самим Собой [Кришной], «Шримад-Бхагаватам». Гададхар Пандит «поил» своего страдающего Друга «вином» *кришна-лилы*, которое опьяняло и утешало Его. Читая, Гададхар Пандит непрерывно плакал, и слезы его были подобны цветам, которые он предлагал как подношение страницам «Шримад-Бхагаватам». Пусть же моей единственной целью будет доставить радость этому сияющему Гададхару Пандиту, лучшему из Госвами!» (Шрила Шридхар Махарадж. Из вступления к неоконченному «Шримад-Бхагаватам в 300 стихах»).
// «Источник всего наслаждения, вмещающий в Себя все расы преданного служения» (См. «Шри Чайтанья-чаритамрита», Мадхья-лила, 18.142; Бхакти-расамрита-синдху 1.1.1).
// *джаладжа̄ навалакш̣а̄н̣и стха̄вара̄ лакш̣а-вим̇ш́атих̣ / кр̣тайо рудра-сан̇кхьяка̄х̣ пакш̣ин̣а̄м̇ даш́а-лакш̣акам / трим̇ш́ал-лакш̣а̄н̣и паш́авах̣ чатур лакш̣а̄н̣и ма̄нуш̣а̄х̣* — «Существует 900.000 видов обитателей вод, 2.000.000 неподвижных форм жизни, 1.100.000 пресмыкающихся, 1000.000 птиц, 3.000.000 животных и 400.000 видов человека» (Виш̣н̣у-пура̄н̣а).
// «Кусума-саровара, Манаса-ганга, дочь Калинды Ямуна с ее быстрым течением…» (Шрила Бхактивинода Тхакур, «Радха-кунда тата» (На берегу Радха-кунды), Шаранагати», Бхакти-анукула, песня 4, стих 2).
// sharanagati
// *кулам̇ павитрам̇ джананӣ кр̣та̄ртха̄, васундхара̄ ва̄ васатиш́ ча дханйа̄ / нр̣тйанти сварге питаро ’пи теш́а̄м̇, йеш̣а̄м̇ куле ваиш̣н̣ава-на̄мадхейам* — «Где бы ни родился вайшнав, его семья, мать, город и дом, где он появился на свет, очищаются от греха, а его предки радостно танцуют в раю» (Упоминается в комментарии к стиху 49 2-й главы Ади-кханды «Шри Чайтанья Бхагаваты»).
// «Теперь, когда Господь Чайтаньячандра явил миру путь беспримесного служения Богу, материалисты перестали говорить о своих женах, детях и мирских делах, ученые оставили свои философские диспуты, йоги перестали беспокоиться о контроле дыхания, подвижники забыли о своих аскезах, а имперсоналисты оставили свое изучение «Веданты». Жителей этого мира больше не привлекало ничего, кроме сладостного вкуса любовного служения Кришне» (Шрила Прабодхананда Сарасвати Тхакур, «Чайтанья-чандрамрита», 113; приводится в комментарии к стихам 414-418 Мадхья-кханды «Шри Чайтанья Бхагаваты»).
// *стрӣ-путра̄ди-катха̄м̇ джахур виш̣айин̣ах̣ ш́а̄стра-права̄дам̇ будха̄, йогӣндра̄ виджахур марун-нийама-джа-клеш́ам̇ тапас та̄паса̄х̣ / джн̃а̄на̄бхйа̄са-видхим̇ джахуш́ ча йатайаш́ чаитанйа-чандре пара̄м, а̄виш̣курвати бхакти-йога-падавӣм̇ наива̄нйа а̄сӣд расах̣* — «Теперь, когда Господь Чайтаньячандра явил миру путь беспримесного служения Богу, материалисты перестали говорить о своих женах, детях и мирских делах, ученые оставили свои философские диспуты, йоги перестали беспокоиться о контроле дыхания, подвижники забыли о своих аскезах, а имперсоналисты оставили свое изучение «Веданты». Жителей этого мира больше не привлекало ничего, кроме сладостного вкуса любовного служения Кришне» (Шрила Прабодхананда Сарасвати Тхакур, «Чайтанья-чандрамрита», 113; приводится в комментарии к стихам 414-418 Мадхья-кханды «Шри Чайтанья Бхагаваты»).

var sa = {};

var SCRIPTURES_SETS = Object.keys(SCRIPTURES).map(s => new Set(s.split(' ')));
// SCRIPTURES_SETS.sort((a, b) => {
//     return - a.size + b.size;
// });
var SCRIPTURES_NAMES = Object.values(SCRIPTURES);

var debug_counter = 1;

class Footnote {

    constructor(documentFile, nodes) {
        this.documentFile = documentFile;
        this.nodes = nodes;

        this.md = this.getMD();
        this.words_set = new Set(this.md.split(/[\u00A0 \?,\.\-"\(\)\[\]\/»«—\*\n\d‑—]+/).filter(i => !!i && i.length > 1).map(s => s.toLowerCase()));
        this.words_str = [...this.words_set].join(' ');

        var scripture_number_match = this.md.match(/\d+([\.-]\d+)*/);
        if (scripture_number_match) {
            this.scripture_number_str = scripture_number_match[0];

            // if (this.scripture_number_str.indexOf('.') === -1 && this.scripture_number_str.indexOf('-') === -1) {
            //     console.log(this.md)
            // }

            if (!this.getScriptureName()) {
                console.log('===============', debug_counter++);
                
                // console.log(this.words_set);
                // console.log('---------------');
                console.log(this.md);
                console.log('---------------');
                console.log(this.md.toLowerCase().replace(/[\u00A0«»\., ‑-]+/g, ' '));
                console.log('---------------');
            }
        }

        documentFile.factory.addFootnote(this);

        // this.getScriptureName();
    }

    getScriptureName() {

        var s_str;

        var match_scripture = SCRIPTURES_NAMES.find((name, idx) => {
            var s = SCRIPTURES_SETS[idx];
            s_str = Array.from(s).join(' ');
            return s.intersection(this.words_set).size === s.size;
        });

        if (match_scripture === 1 && !sa[s_str]) {
            sa[s_str] = 1;
            console.log('========= Scripture without name')
            console.log(s_str);
            console.log('--------')
            console.log(this.getMD());
            console.log('')
        }

        return match_scripture;
    }

    getScriptureNameWithNumber() {
        var scriptureName = this.getScriptureName();
        if (typeof scriptureName === 'string' && this.scripture_number_str) {
            return scriptureName + ' ' + this.scripture_number_str;
        } else {
            // TODO: check what is without scripture_number_str
        }
    }

    getMD() {
        var md = '';
    
        this.nodes.forEach(node => {
            switch(node.type) {
                case "footnote":
                case "p":
                    md += node.text  + '\n';
                    break;
                case "code":
                    md += '    ' + node.text  + '\n';
                    break;
                case "br":
                    md += '\n';
                    break;
            }
        });
    
        return md;
    }

    renderDebug() {
        return '# ' + this.nodes[0].id + '\n\n' + this.md;
    }
}

function analyzeFootnotes2()  {
    for(var i = 0; i < all_footnotes.length; i++) {
        var f1 = all_footnotes[i];
        if (f1.similar) {
            continue;
        }

        for(var j = i + 1; j < all_footnotes.length; j++) {
            var f2 = all_footnotes[j];
            if (f2.similar) {
                continue;
            }

            var ins = f1.words_set.intersection(f2.words_set);
            var f1p = ins.size / f1.words_set.size;
            var f2p = ins.size / f2.words_set.size;

            if (f1p > 0.5 && f2p > 0.5 && f1.words_set.size > 2 && f2.words_set.size > 2) {
                console.log('i', i, j, all_footnotes.length);
                console.log('=================', f1.words_set.size, f2.words_set.size, ins.size, f1p, f2p);
                // console.log('=================', f1.words_set, f2.words_set, ins);
                console.log(f1.md)
                console.log('----');
                console.log(f2.md);

                f2.similar = true;
            }
        }
    }
};


module.exports = {
    Footnote,
    analyzeFootnotes2
};
