var SCRIPTURES = {
    "шветашватара упанишад": "Шветашватара-упанишад",
    "бхакти расамрита синдху": "Бхакти-расамрита-синдху",
    "веданта сутра": "Веданта-сутра",
    "ману самхита": "Ману-самхита",
    "шримад бхагаватам": "Шримад-Бхагаватам",
    "бхагавад гита": "Бхагавад-гита",
    "шри шикшаштакам": "Шри Шикшаштакам",
    "гита говинда": "Шри Гита-Говинда",
    "шри шикшаштака": "Шри Шикшаштакам",
    "риг веда": "Риг-веда",
    "брахма самхита": "Шри Брахма-самхита",
    "гита мала": "Гита-мала",
    "катха упанишад": "Катха-упанишад",
    "бхакти сандарбха": "Бхакти-сандарбха",
    "хитопадеша": "Хитопадеша",
    "шад госвами аштака": "Шад-Госвами-аштака",
    "чайтанья чаритамрита антья лила": "«Шри Чайтанья-чаритамрита», Антья-лила",
    "чайтанья чаритамрита мадхья лила": "«Шри Чайтанья-чаритамрита», Мадхья-лила",
    "чайтанья чаритамрита ади лила": "«Шри Чайтанья-чаритамрита», Ади-лила",
    "поиск шри кришны": "Поиск Шри Кришны",
    "падьявали шрилы рупы госвами": "Падьявали", // 1
    "гоптритве варана": "Гоптритве варана",
    "шрила бхактивинод тхакур шаранагати": "Шаранагати", // 1
    "вилапа кусуманджали": "Шри Вилапа-кусуманджали",
    "шри кришнера аштоттара шата нама": "Шри Шри Кришнера аштоттара-шата-нама",
    "бхаджана рахасья вритти": "Бхаджана-рахасья-вритти",
    "према виварта": "Према-виварта",
    "падма пурана уттара кханда": "«Падма-пурана», Уттара-кханда",
    "према дхама дева стотрам": "Према-Дхама-Дева-стотрам",
    "гитамала ямуна бхававали": "«Гитамала», Ямуна-бхававали",
    "таттва сандарбха": "Таттва-сандарбха",
    "радха раса судха нидхи": "Радха-раса-судха-нидхи",

    //---
    "тайттирия упанишад": "Тайттирия-упанишад",
    "чхандогья упанишад": "Чхандогья-упанишад"
    
};

// TODO:
// multi
// *нахи джанамало наме анурага мора / бхактивинода-читта духкхе бибхора* — «У меня никогда не было никакой привязанности к Святым Именам! Поэтому сердце Бхактивинода полно скорби!» (Шрила Бхактивинод Тхакур, «Шри Шикшаштакам», (цикл песен), второй стих, песня вторая, 5).
// *пашу-пакши хойе тхаки сварге ба ниройе / таба бхакти раху бхактивинода-хридойе* — «Буду ли я птицей или зверем, буду жить в раю или аду, позволь непритязательному Бхактивиноду всегда лелеять в глубине своего сердца преданность Тебе!» (Шрила Бхактивинод Тхакур, «Шри Шикшаштакам» (цикл песен), четвертый стих, песня четвертая, 7).
// *вичакшана кори’, декхите чахиле, хойа анкхи-агочара / пунах нахи декхи’, кандайе парана, духкхера нахи тхаке ора* — «Стоит мне пожелать увидеть Его ближе, как вдруг Он становится невидимым! Не видя Его, моя душа плачет, и моему горю нет ни конца, ни края» («Гитавали», Шрила Бхактивинода Тхакур, Раздел 12 — «Шри Шикшаштака», Бенгальские песни, основанные на «Шикшаштаке» Шри Чайтаньи Махапрабху, Песня 8-1, стих 2).
// «Вобрав в себя чистые золотистые воды реки Джамбу, воспетой в «Шримад-Бхагаватам», не воспарило ли это золотое облако на гору, куда снизошла золотая луна (Шри Гаурачандра), чтобы пролить потоки дождя на все окрестности, поглощенные лесным пожаром (тройственных страданий), а затем неожиданно скрылось в пыли земли на месте явления Шри Гауранги? О Дина-наяна, где бы ни находилась эта великая душа, молю, скорей отведи этого слугу к ней!» (Шрила Шридхар Махарадж, «Шри Дайита Дас Дашакам, 5).
// «Вишванатх Чакраварти Тхакур стал *шикша-гуру* [наставляющим духовным учителем] Баладева Видьябхушана, которому раскрыл знание «Шримад-Бхагаватам». После Шри Баладева Видьябхушана самым выдающимся *ачарьей* стал Джаганнатх Дас Бабаджи, которого Шри Бхактивинод Тхакур принял своим *шикша-гуру*. Близким другом и спутником Бхактивинода Тхакура был знаменитый *маха-бхагавата-вайшнав* Шри Гауракишор Дас Бабаджи, черпающий единственную радость в *Хари-бхаджане*.» (Шрила Бхактисиддханта Сарасвати Госвами Прабхупада, Шри Гуру-парампара, 8).
// «Тхакур Вриндаван дас описал игры Господа Чайтаньи, подобно тому как Вьясадева описал все игры Господа Кришны в «Шримад-Бхагаватам»» («Шри Чайтанья-чаритамрита», Ади-лила, 8.34).
// [Рамананда Рай продолжает:] «Те, кто, даже держась за свое прочное социальное положение, отбрасывают процесс умозрительного познания и своими телом, словами и умом выказывают все почтение описаниям Твоей Личности и деяний, посвящая свои жизни этим рассказам, которые произносишь Ты сам и Твои чистые преданные, несомненно побеждают Твою Светлость, хотя в других случаях Тебя не одолеть никому в трех мирах» («Шримад-Бхагаватам», 10,14.3; стих приводится также в «Шри Чайтанья-чаритамрите», Мадхья-лила, 8.67).
// «На берегу бескрайнего синего океана Гададхар Пандит читал Шри Чайтанье Махапрабху, мучимому великой внутренней болью разлуки с самим Собой [Кришной], «Шримад-Бхагаватам». Гададхар Пандит «поил» своего страдающего Друга «вином» *кришна-лилы*, которое опьяняло и утешало Его. Читая, Гададхар Пандит непрерывно плакал, и слезы его были подобны цветам, которые он предлагал как подношение страницам «Шримад-Бхагаватам». Пусть же моей единственной целью будет доставить радость этому сияющему Гададхару Пандиту, лучшему из Госвами!» (Шрила Шридхар Махарадж. Из вступления к неоконченному «Шримад-Бхагаватам в 300 стихах»).

var sa = {};

var SCRIPTURES_SETS = Object.keys(SCRIPTURES).map(s => new Set(s.split(' ')));
var SCRIPTURES_NAMES = Object.values(SCRIPTURES);

class Footnote {

    constructor(documentFile, nodes) {
        this.documentFile = documentFile;
        this.nodes = nodes;

        this.md = this.getMD();
        this.words_set = new Set(this.md.split(/[ ,\.\-"\(\)\[\]\/»«—\*\n\d]+/).filter(i => !!i && i.length > 2).map(s => s.toLowerCase()));
        this.words_str = [...this.words_set].join(' ');

        var scripture_number_match = this.md.match(/\d+(\.\d+)*/);
        if (scripture_number_match) {
            this.scripture_number_str = scripture_number_match[0];
        }

        documentFile.factory.addFootnote(this);

        // this.getScriptureName();
    }

    getScriptureName() {

        var s_str;

        var match_scripture = SCRIPTURES_NAMES.find((name, idx) => {
            var s = SCRIPTURES_SETS[idx];
            s_str = Array.from(s).join(' ');
            return s.intersection(this.words_set).size === s.size;
        });

        if (match_scripture === 1 && !sa[s_str]) {
            sa[s_str] = 1;
            console.log('========= Scripture without name')
            console.log(s_str);
            console.log('--------')
            console.log(this.getMD());
            console.log('')
        }

        return match_scripture;
    }

    getScriptureNameWithNumber() {
        var scriptureName = this.getScriptureName();
        if (typeof scriptureName === 'string' && this.scripture_number_str) {
            return scriptureName + ' ' + this.scripture_number_str;
        } else {
            // TODO: check what is without scripture_number_str
        }
    }

    getMD() {
        var md = '';
    
        this.nodes.forEach(node => {
            switch(node.type) {
                case "footnote":
                case "p":
                    md += node.text  + '\n';
                    break;
                case "code":
                    md += '    ' + node.text  + '\n';
                    break;
                case "br":
                    md += '\n';
                    break;
            }
        });
    
        return md;
    }

    renderDebug() {
        return '# ' + this.nodes[0].id + '\n\n' + this.md;
    }
}

function analyzeFootnotes2()  {
    for(var i = 0; i < all_footnotes.length; i++) {
        var f1 = all_footnotes[i];
        if (f1.similar) {
            continue;
        }

        for(var j = i + 1; j < all_footnotes.length; j++) {
            var f2 = all_footnotes[j];
            if (f2.similar) {
                continue;
            }

            var ins = f1.words_set.intersection(f2.words_set);
            var f1p = ins.size / f1.words_set.size;
            var f2p = ins.size / f2.words_set.size;

            if (f1p > 0.5 && f2p > 0.5 && f1.words_set.size > 2 && f2.words_set.size > 2) {
                console.log('i', i, j, all_footnotes.length);
                console.log('=================', f1.words_set.size, f2.words_set.size, ins.size, f1p, f2p);
                // console.log('=================', f1.words_set, f2.words_set, ins);
                console.log(f1.md)
                console.log('----');
                console.log(f2.md);

                f2.similar = true;
            }
        }
    }
};


module.exports = {
    Footnote,
    analyzeFootnotes2
};
