var SCRIPTURES = [
    {"шветашватара упанишад": "Шветашватара-упанишад"},
    {"бхакти расамрита синдху": "Бхакти-расамрита-синдху"},
    {"веданта сутра": "Веданта-сутра"},
    {"ману самхита": "Ману-самхита"},
    {"шримад бхагаватам": "Шримад-Бхагаватам",
        "шримад бхагаватам стихах": "Шримад-Бхагаватам в 300 стихах"},

    {"бхагавад гита": "Бхагавад-гита",
        "бхагавад гиты": "Бхагавад-гита",
        "бхагавад гите": "Бхагавад-гита"},

    {"шри шикшаштакам": "Шри Шикшаштакам",
        "шри шикшаштака": "Шри Шикшаштакам"},

    {"гита говинда": "Шри Гита-Говинда"},
    {"риг веда": "Риг-веда"},
    {"брахма самхита": "Шри Брахма-самхита"},
    {"гита мала": "Гита-мала"},
    {"катха упанишад": "Катха-упанишад"},

    {"бхакти сандарбха": "Бхакти-сандарбха",
        "бхакти сандарбхе": "Бхакти-сандарбха"},

    {"таттва сандарбха": "Таттва-сандарбха"},
    {"бхагавад сандарбха": "Бхагавад-сандарбха"},
    {"хитопадеша": "Хитопадеша"},
    {"шад госвами аштака": "Шад-Госвами-аштака"},

    {"чайтанья чаритамрита антья": "«Шри Чайтанья-чаритамрита», Антья-лила",
        "чайтанья чаритамриты антья": "«Шри Чайтанья-чаритамрита», Антья-лила",
        "чайтанья чаритамриту антья": "«Шри Чайтанья-чаритамрита», Антья-лила",
        "чайтанья чаритамрите антья": "«Шри Чайтанья-чаритамрита», Антья-лила",
        "чайтанья чаритамрите антья": "«Шри Чайтанья-чаритамрита», Антья-лила"},

    {"чайтанья чаритамрита мадхья": "«Шри Чайтанья-чаритамрита», Мадхья-лила",
        "чайтанья чаритамрите мадхья": "«Шри Чайтанья-чаритамрита», Мадхья-лила",
        "чайтанья чаритамриты мадхья": "«Шри Чайтанья-чаритамрита», Мадхья-лила",
        "чайтанья чаритамриту мадхья": "«Шри Чайтанья-чаритамрита», Мадхья-лила"},

    {"чайтанья чаритамрита ади": "«Шри Чайтанья-чаритамрита», Ади-лила",
        "чайтанья чаритамрите ади": "«Шри Чайтанья-чаритамрита», Ади-лила",
        "чайтанья чаритамриты ади": "«Шри Чайтанья-чаритамрита», Ади-лила",
        "чайтанья чаритамриту ади": "«Шри Чайтанья-чаритамрита», Ади-лила"},
    
    {"поиск шри кришны": "Поиск Шри Кришны"},
    {"падьявали": "Падьявали"},
    {"гоптритве варана": "Гоптритве варана"},
    {"шаранагати": "Шаранагати"}, // 1
    {"вилапа кусуманджали": "Шри Вилапа-кусуманджали"},
    {"вилāпа кусумāн̃джали": "Шри Вилапа-кусуманджали"},
    {"шри кришнера аштоттара шата нама": "Шри Шри Кришнера аштоттара-шата-нама"},
    {"бхаджана рахасья вритти": "Бхаджана-рахасья-вритти"},
    {"према виварта": "Према-виварта"},
    {"падма пурана уттара": "«Падма-пурана», Уттара-кханда",
        "падма пураны уттара": "«Падма-пурана», Уттара-кханда"},
    {"према дхама дева стотрам": "Према-Дхама-Дева-стотрам"},
    {"гитамала ямуна бхававали": "«Гитамала», Ямуна-бхававали"},
    {"радха раса судха нидхи": "Радха-раса-судха-нидхи"},
    {"шри гуру парампара": "Шри Гуру-парампара"},

    {"чайтанья бхагавата мадхья": "«Шри Чайтанья Бхагавата», Мадхья-кханда",
        "чайтанья бхагаваты мадхья": "«Шри Чайтанья Бхагавата», Мадхья-кханда"},
    {"чайтанья бхагавата антья": "«Шри Чайтанья Бхагавата», Антья-кханда",
        "чайтанья бхагаваты антья": "«Шри Чайтанья Бхагавата», Антья-кханда"},
    {"чайтанья бхагавата ади": "«Шри Чайтанья Бхагавата», Ади-кханда",
        "чайтанья бхагаваты ади": "«Шри Чайтанья Бхагавата», Ади-кханда"},

    {"лалита аштака": "Шри Лалита-аштака"},
    {"шри дайита даса пранати панчакам": "Шри Дайита Даса Пранати Панчакам"},
    {"дайита дас дашакам": "Шри Шри Дайита Дас Дашакам"},
    {"прабхупада падма ставаках": "Шри Шри Прабхупада-падма Ставаках"},
    {"шриман нитьянанда двадашакам": "Шриман Нитьянанда Двадашакам"},
    {"нитай гунамани амара": "Нитай гунамани амара"},
    {"шримад бхактивинода вираха дашакам": "Шримад Бхактивинода-вираха Дашакам"},
    {"гитавали": "Гитавали"},
    {"прапанна дживанамритам": "Шри Шри Прапанна-дживанамритам"},
    // "прартхана": "Прартхана",
    {"сарвасва томара": "Сарвасва томара"},
    {"гитамахатмйам": "Гитамахатмйам"},
    {"гурваштака": "Шри Гурваштака"},
    {"ишопанишад": "Шри Ишопанишад"},
    {"прартханашрая чатурдашака": "Шри Прартханашрая-чатурдашака"},

    {"манах шикша": "Манах-шикша",
        "манах̣ ш́икш̣а̄": "Манах-шикша"},

    {"вайшнава ке": "Вайшнава ке"},
    {"мундака упанишад": "Мундака Упанишад"},
    {"таиттирия упанишад": "Таиттирия-упанишад"},
    {"махабхарата ади парва": "«Махабхарата», Ади-парва"},
    {"махабхарата удьога парва": "«Махабхарата», Удьога-парва"},

    {"махабхарата бхишма парва": "«Махабхараты», Бхишма-парва",
        "махабхараты бхишма парва": "«Махабхараты», Бхишма-парва"},
    
    {"махабхарата вана парва": "«Махабхараты», Вана-парва",
        "махабхараты вана парва": "«Махабхараты», Вана-парва"},
    
    {"анйа абхилаша чхади": "Анйа-абхилаша чхади",
        "анйа абхила̄ш̣а чха̄д̣и": "Анйа-абхилаша чхади"},

    {"джайва дхарма": "Джайва-дхарма",
        "джайва дхарме": "Джайва-дхарма"},

    {"ари бхакти виласа": "Хари-бхакти-виласа"},
    {"брихан нарадия пурана": "Брихан-нарадия-пурана"},
    {"катха упанишада": "Катха-Упанишада"},
    {"чхандогья упанишада": "Чхандогья-упанишада"},
    {"шветашватара упанишада": "Шветашватара-упанишада"},
    {"чайтанья чандрамрита": "Чайтанья-чандрамрита"},
    {"мукта чаритра": "Мукта Чаритра"},
    {"кальяна калпатару": "Кальяна-калпатару"},
    {"враджа виласа става": "Враджа-виласа-става"},
    {"шад госвами аштакам": "Шри Шад Госвами Аштакам"},
    {"кришна карнамрита": "Кришна-карнамрита"},

    {"брихад бхагаватамрита": "Брихад Бхагаватамрита",
        "брихад бхагаватамритам": "Брихад Бхагаватамрита"},
    
    {"намаштакам": "Намаштакам"},

    {"прартхана лаласа": "«Прартхана», Лаласа",
        "даинйа прартхана гити": "Даинйа Прартхана Гити",
        "шри прартхана": "Шри Прартхана"},

    {"шри дана кели чинтамани": "Шри Дана-кели Чинтамани"},
    {"шри лалита аштакам": "Шри Лалита-аштакам"},
    {"упадешамрита": "Шри Упадешамрита"},
    {"кабе муи вайшнава чинибо": "Кабе муи вайшнава чинибо"},
    {"шримад гауракишора намаскара дашакам": "Шри Шримад Гауракишора-намаскара Дашакам"},
    {"рупануга махатмья": "Шри рупануга-махатмья"},
    {"акродха парамананда": "Акродха парамананда"},
    {"джанама сапхала тара": "Джанама сапхала тара"},
    {"радхаштака": "Шри Радхаштака"},
    {"бхаджана лаласа": "Бхаджана-лаласа"},
    {"чайтаньяштака": "Шри Чайтаньяштака"},
    {"кали гхора тимире": "Кали-гхора тимире"},
    {"ригведа": "Ригведа"},
    {"кабе шри чаитанйа море корибена дойа": "Кабе шри чаитанйа море корибена дойа"},
    {"гауранга каруна коро": "Гауранга каруна коро"},
    {"нитай пада камала": "Нитай-Пада-Камала"},
    {"рагхувамша": "Рагхувамша"},

    {"вишну пурана": "Вишну-пурана",
        "вишну пураны": "Вишну-пурана",
        "виш̣н̣у пура̄н̣а": "Вишну-пурана"},

    {"мангалачарана": "Мангалачарана"},
    {"наваграха стотра": "Наваграха стотра"},
    {"нама санкиртан": "Нама-санкиртан"},
    {"слово хранителя преданности": "Слово Хранителя Преданности"},

    {"ачарья вандана": "Ачарья вандана",
        "а̄ча̄рйа вандана": "Ачарья вандана"},

    {"шри нама": "Шри Нама"},
    {"шуддха бхаката": "Шуддха-бхаката"},
    {"манаса дехо гехо": "Манаса дехо гехо"},
    {"саи кева сунаило шйама нама": "Саи, Кева Сунаило Шйама-нама"},
    {"даинья прапатти": "Даинья о прапатти"},  
    {"ману смрити": "Ману-смрити"},
    {"атма самарпане": "Атма-самарпане"},
    {"ш́рӣ кр̣ш̣н̣ера вим̇соттара ш́ата на̄ма": "Ш́рӣ Кр̣ш̣н̣ера Вим̇соттара-ш́ата-на̄ма"},
    {"чаураграганья пуруша аштака": "Шри Чаураграганья-пуруша-аштака"},
    {"радха бхаджана махима": "Шри Радха-бхаджана махима"},
    {"хари бхакти виласа прабхаса кханда": "«Хари-бхакти-виласа», Прабхаса-кханда"},
    {"пратхама йама садхана шраддха": "Пратхама-йама садхана - Шраддха"},
    {"таиттирийа упанишад": "Таиттирийа-упанишад"},
    {"према бхакти чандрика": "Шри Према-бхакти-чандрика"},

    {"тайттирия упанишад": "Тайттирия-упанишад",
        "чхандогья упанишад": "Чхандогья-упанишад"},

    // TOOD: find matches.
    {"лагху бхагаватамрите": "Лагху-бхагаватамрита",
        "лагху бхагаватамрита": "Лагху-бхагаватамрита"},

    {"видагдха мадхава": "Видагдха-мадхава"},
    {"шрингара бхеда пракарана": "«Уджджвала-ниламани», Шрингара-бхеда-пракарана"},
    {"мукунда мала стотра": "Мукунда-мала-стотра"},
    {"чайтанья чандродая натака": "Шри Чайтанья-чандродая-натака"},
    {"хари бхакти судходая": "Хари-бхакти-судходая"},
    // {"чайтанья бхагавата": "Чайтанья-Бхагавата"}
];

var NAMES_SEARCH_SHORTCUTS = {
    'даинья прапатти': 'даинья о прапатти',
    'чайтанья чаритамрите антья': ['антья лила', 'антья лиле'],
    'чайтанья бхагавата мадхья': ['мадхья лила', 'мадхья лиле'],
    'чайтанья чаритамриты мадхья': ['мадхья лила', 'мадхья лилы', 'мадхья лиле'],
    'чайтанья чаритамрита антья': ['антья лила', 'антья лиле', 'антья лилы'],
    'чайтанья чаритамриты ади': ['ади лила', 'ади лилы', 'ади лиле'],
    'чайтанья бхагаваты мадхья': ['мадхья кханды'],
    'чайтанья чаритамрита мадхья': ['мадхья лила', 'мадхья лиле'],
    'чайтанья чаритамрите мадхья': ['мадхья лила', 'мадхья лиле'],
    'чайтанья чаритамрите ади': ['ади лила', 'ади лиле'],
};

// TODO:
// multi
// «Когда семя экстатических эмоций к Кришне начинает приносить плоды, в поведении человека проявляются следующие девять признаков: всепрощение, нежелание попусту тратить время, отрешенность от мира, отсутствие гордыни, надежда, устремленность, вкус к повторению Святого Имени Господа, привязанность к описанию трансцендентных качеств Господа, влечение к тем местам, где пребывает Господь [храмы или святые места, например Вриндаван]. Все это называется *анубхавами*, вторичными признаками экстатических эмоций. Их можно заметить в человеке, в сердце которого начало плодоносить семя любви к Богу» («Бхакти-расамрита-синдху», 1.3.25–26; цитируется в Мадхья-лиле «Шри Чайтанья-чаритамриты» (23.18-19)).
// 23.18-19 - multi files, same quote.
// *наче’ джео намер гуне о саб пхала паи ре, (туччха пхале прайас чхеде’ ре) / винод боле джаи ло’йе намер балаи ре, (намер балаи чхеде’ ре)* — «Благодаря силе и трансцендентным качествам Харинамы, я экстатически танцую. Через этот возвышенный процесс ко мне приходит все желаемое! Оставив все тщетные попытки обрести что-либо мирское, Бхактивинода говорит: «Я смог преодолеть все препятствия и *апарадхи* (оскорбления), и теперь я имею возможность повторять *шуддха-нам*!»». (Шрила Бхактивинод Тхакур, «Гитавали» «Шри нама-киртана», 3.5).
// *а̄мна̄йах̣ пра̄ха таттвам̇ харим иха парамам̇ сарва-ш́актим̇ раса̄бдхим̇, тад-бхинна̄м̇ш́а̄м̇ш́ ча джӣва̄н пракр̣ти-кавалита̄н тад-вимукта̄м̇ш́ ча бха̄ва̄д / бхеда̄бхеда-прака̄ш́ам̇ сакалам апи харих̣ са̄дханам̇ ш́уддха-бхактим̇, са̄дхайам̇ тат-прӣтим эвети упадеш́айати джана̄н гаурачандрах̣ свайам̇ сах̣* — «Достоверное ведическое знание, полученное по истинной наставнической преемственности, выражается в следующих основополагающих понятиях: (1) Хари — Высшая Абсолютная Истина; (2) Он всемогущ; (3) Он источник сладости всех видов взаимоотношений; (4) Живые существа — Его отделенные неотъемлемые частицы; (5) Одни живые существа порабощены майей; (6) Другие живые существа свободны от влияния майи; (7) Все мироздание одновременно и едино с Ним, и отлично от Него; (8) Шуддха-бхакти — единственный способ обрести любовь к Богу; (9) Цель жизни — обрести любовь к Богу. Этому учил Сам Гаурачандра» (Шрила Бхактивинод Тхакур, «Даша-мула-шикша». Приводится в «Джайва Дхарме, гл. 13).
// «С тех пор как мой ум погрузился в служение лотосным стопам Господа Кришны, я испытываю все возрастающую духовную радость, и при одной мысли о близости с женщиной мое лицо искажается в отвращении и я сплевываю» (Шлока Ямуначарьи, приводится в Шрилой Бхактиведантой Свами в комментарии к стиху 2.60 Бхагавад-гиты).
// ---error scriptures *чето-дарпан̣а-ма̄рджанам̇ бхава-маха̄-да̄ва̄гни-нирва̄пан̣ам̇, ш́рейах̣-каирава-чандрика̄-витаран̣ам̇ видйа̄-вадху-джӣванам̇ / а̄нанда̄мбудхи-варддханам̇ прати-падам̇ пӯрн̣а̄мр̣та̄сва̄данам̇, сарва̄тма-снапанам̇ парам̇ виджайате ш́рӣ-кр̣ш̣н̣а-сан̇кӣрттанам* — «Слава воспеванию Святого Имени Шри Кришны, которое 1) сметает всю грязь с зеркал наших сердец; 2) гасит великий пожар страдания, порожденный круговоротом рождений и смертей; 3) проливает лунный свет вечного блага на лилию души воспевающего; 4) сама жизнь невесты Абсолютной Истины; 5) увеличивает океан упоительного блаженства; 6) при каждом Его произнесении дарует богатый вкус чистого нектара; 7) омывает, то есть очищает и обновляет всю личность [воспевающего], включая тело, ум и душу, в божественном блаженстве» (Всевышний Господь Шри Чайтаньячандра, «Шри Шикшаштакам», 1)
// «Брихад-Вишну-пурана
// *хр̣дайа хаите бале, джихва̄ра агрета чале, ш́абда-рӯпе на̄че анукш̣ан̣а / кан̣т̣хе мора бхан̇ге свара, ан̇га ка̄̐пе тхара тхара, стхира хаите на̄ па̄ре чаран̣а* — «Святое Имя исходит из моего сердца, появляется на языке и постоянно танцует на нем в форме трансцендентного звука. Дыхание прерывается, тело бьет сильная дрожь, а ноги передвигаются сами по себе» (Шрила Бхактивинод Тхакур, «Шаранагати», «Шри Нама-махатмья», 2).
// [^_ftn4]: *виш̣н̣у-ш́актих̣ пара̄ прокта̄, кш̣етраджн̃а̄кхйа̄ татха̄ пара̄ / авидйа̄-карма-сам̇джн̃а̄нйа̄, тр̣тӣйа̄ ш́актир иш̣йате* — «Внутренняя энергия Верховного Господа Вишну духовна, и шастры подтверждают это. Существует еще одна духовная энергия, называемая кшетра-гья, то есть живое существо. Третья энергия, именуемая энергией неведения, заставляет живое существо погрязнуть в безбожии и кармической деятельности» («Вишну-пурана», 6.7.61; приводится в «Шри Чайтанья-чаритамрите»).
// *на̄мно ’сйа йа̄ватӣ ш́актих̣, па̄па-нирхаран̣е харех̣ / та̄ват карттум̇ на ш́акноти, па̄такам̇ па̄такӣ джанах* — «Просто однажды повторив Святое Имя Господа Хари, греховный человек может противостоять реакциям большего количества грехов, чем он способен совершить» («Брихад-Вишну-пурана», приводится в «Бхаджана-рахасье» («Пратхама-йама садхана — Шраддха», 4) Шрилы Бхактивинода Тхакура).
// *нахи джанамало наме анурага мора / бхактивинода-читта духкхе бибхора* — «У меня никогда не было никакой привязанности к Святым Именам! Поэтому сердце Бхактивинода полно скорби!» (Шрила Бхактивинод Тхакур, «Шри Шикшаштакам», (цикл песен), второй стих, песня вторая, 5).
// *пашу-пакши хойе тхаки сварге ба ниройе / таба бхакти раху бхактивинода-хридойе* — «Буду ли я птицей или зверем, буду жить в раю или аду, позволь непритязательному Бхактивиноду всегда лелеять в глубине своего сердца преданность Тебе!» (Шрила Бхактивинод Тхакур, «Шри Шикшаштакам» (цикл песен), четвертый стих, песня четвертая, 7).
// *вичакшана кори’, декхите чахиле, хойа анкхи-агочара / пунах нахи декхи’, кандайе парана, духкхера нахи тхаке ора* — «Стоит мне пожелать увидеть Его ближе, как вдруг Он становится невидимым! Не видя Его, моя душа плачет, и моему горю нет ни конца, ни края» («Гитавали», Шрила Бхактивинода Тхакур, Раздел 12 — «Шри Шикшаштака», Бенгальские песни, основанные на «Шикшаштаке» Шри Чайтаньи Махапрабху, Песня 8-1, стих 2).
// «Вобрав в себя чистые золотистые воды реки Джамбу, воспетой в «Шримад-Бхагаватам», не воспарило ли это золотое облако на гору, куда снизошла золотая луна (Шри Гаурачандра), чтобы пролить потоки дождя на все окрестности, поглощенные лесным пожаром (тройственных страданий), а затем неожиданно скрылось в пыли земли на месте явления Шри Гауранги? О Дина-наяна, где бы ни находилась эта великая душа, молю, скорей отведи этого слугу к ней!» (Шрила Шридхар Махарадж, «Шри Дайита Дас Дашакам, 5).
// «Вишванатх Чакраварти Тхакур стал *шикша-гуру* [наставляющим духовным учителем] Баладева Видьябхушана, которому раскрыл знание «Шримад-Бхагаватам». После Шри Баладева Видьябхушана самым выдающимся *ачарьей* стал Джаганнатх Дас Бабаджи, которого Шри Бхактивинод Тхакур принял своим *шикша-гуру*. Близким другом и спутником Бхактивинода Тхакура был знаменитый *маха-бхагавата-вайшнав* Шри Гауракишор Дас Бабаджи, черпающий единственную радость в *Хари-бхаджане*.» (Шрила Бхактисиддханта Сарасвати Госвами Прабхупада, Шри Гуру-парампара, 8).
// «Тхакур Вриндаван дас описал игры Господа Чайтаньи, подобно тому как Вьясадева описал все игры Господа Кришны в «Шримад-Бхагаватам»» («Шри Чайтанья-чаритамрита», Ади-лила, 8.34).
// [Рамананда Рай продолжает:] «Те, кто, даже держась за свое прочное социальное положение, отбрасывают процесс умозрительного познания и своими телом, словами и умом выказывают все почтение описаниям Твоей Личности и деяний, посвящая свои жизни этим рассказам, которые произносишь Ты сам и Твои чистые преданные, несомненно побеждают Твою Светлость, хотя в других случаях Тебя не одолеть никому в трех мирах» («Шримад-Бхагаватам», 10,14.3; стих приводится также в «Шри Чайтанья-чаритамрите», Мадхья-лила, 8.67).
// «На берегу бескрайнего синего океана Гададхар Пандит читал Шри Чайтанье Махапрабху, мучимому великой внутренней болью разлуки с самим Собой [Кришной], «Шримад-Бхагаватам». Гададхар Пандит «поил» своего страдающего Друга «вином» *кришна-лилы*, которое опьяняло и утешало Его. Читая, Гададхар Пандит непрерывно плакал, и слезы его были подобны цветам, которые он предлагал как подношение страницам «Шримад-Бхагаватам». Пусть же моей единственной целью будет доставить радость этому сияющему Гададхару Пандиту, лучшему из Госвами!» (Шрила Шридхар Махарадж. Из вступления к неоконченному «Шримад-Бхагаватам в 300 стихах»).

// TODO: think
// sharanagati
// «Кусума-саровара, Манаса-ганга, дочь Калинды Ямуна с ее быстрым течением…» (Шрила Бхактивинода Тхакур, «Радха-кунда тата» (На берегу Радха-кунды), Шаранагати», Бхакти-анукула, песня 4, стих 2).

// TODO: review scripture name sequence
// *кулам̇ павитрам̇ джананӣ кр̣та̄ртха̄, васундхара̄ ва̄ васатиш́ ча дханйа̄ / нр̣тйанти сварге питаро ’пи теш́а̄м̇, йеш̣а̄м̇ куле ваиш̣н̣ава-на̄мадхейам* — «Где бы ни родился вайшнав, его семья, мать, город и дом, где он появился на свет, очищаются от греха, а его предки радостно танцуют в раю» (Упоминается в комментарии к стиху 49 2-й главы Ади-кханды «Шри Чайтанья Бхагаваты»).
// «Теперь, когда Господь Чайтаньячандра явил миру путь беспримесного служения Богу, материалисты перестали говорить о своих женах, детях и мирских делах, ученые оставили свои философские диспуты, йоги перестали беспокоиться о контроле дыхания, подвижники забыли о своих аскезах, а имперсоналисты оставили свое изучение «Веданты». Жителей этого мира больше не привлекало ничего, кроме сладостного вкуса любовного служения Кришне» (Шрила Прабодхананда Сарасвати Тхакур, «Чайтанья-чандрамрита», 113; приводится в комментарии к стихам 414-418 Мадхья-кханды «Шри Чайтанья Бхагаваты»).
// *стрӣ-путра̄ди-катха̄м̇ джахур виш̣айин̣ах̣ ш́а̄стра-права̄дам̇ будха̄, йогӣндра̄ виджахур марун-нийама-джа-клеш́ам̇ тапас та̄паса̄х̣ / джн̃а̄на̄бхйа̄са-видхим̇ джахуш́ ча йатайаш́ чаитанйа-чандре пара̄м, а̄виш̣курвати бхакти-йога-падавӣм̇ наива̄нйа а̄сӣд расах̣* — «Теперь, когда Господь Чайтаньячандра явил миру путь беспримесного служения Богу, материалисты перестали говорить о своих женах, детях и мирских делах, ученые оставили свои философские диспуты, йоги перестали беспокоиться о контроле дыхания, подвижники забыли о своих аскезах, а имперсоналисты оставили свое изучение «Веданты». Жителей этого мира больше не привлекало ничего, кроме сладостного вкуса любовного служения Кришне» (Шрила Прабодхананда Сарасвати Тхакур, «Чайтанья-чандрамрита», 113; приводится в комментарии к стихам 414-418 Мадхья-кханды «Шри Чайтанья Бхагаваты»).

var SCRIPTURES_MAP = SCRIPTURES.map(obj => {
    return Object.keys(obj).map(id => {
        return {
            id: id,
            text: obj[id],
            set: new Set(id.split(' '))
        };
    });
});

var debug_counter = 1;
var debug_not_found_dict = {};

class Footnote {

    constructor(documentFile, nodes) {
        this.documentFile = documentFile;
        this.nodes = nodes;

        this.md = this.getMD();

        // Lower case without punctuation to search matches position.
        var words = this.md.toLowerCase().split(/[\u00A0 \?,\.\-"\(\)\[\]\/»«—\*\n‑–—]+/);
        this.words_str = words.join(' ');

        // Revemo digints for words set
        this.words_set = new Set(this.words_str.split(/[ \d]+/).filter(i => !!i && i.length > 1));

        var scriptureNumbers = this.getScripturesNubmers();
        if (scriptureNumbers.length > 0) {
            this.scripture_numbers = scriptureNumbers;
        }
        var scriptureNames = this.getScripturesNames();
        if (scriptureNames.length > 0) {
            this.scripture_names = scriptureNames;
        }

        this.scripture_names_with_numbers = this.getScripturesNameWithNumber();

        documentFile.factory.addFootnote(this);
    }

    getScripturesNameWithNumber() {
        if (this.scripture_names && this.scripture_numbers) {

            var items = [...this.scripture_names, ...this.scripture_numbers];

            items.sort((a, b) => a.idx - b.idx);

            var result = [];
            var currentName = {};
            var prevIdxEnd = 0;
            var lastSequenceNumber; // Skip 1, 2, 3, 4.
            items.forEach(item => {
                if ((result.length === 0 // Skip first names without numbers.
                    || !currentName.name) && item.name) {
                    currentName.name = item.name;
                    lastSequenceNumber = null;

                } else if (currentName.name && item.value) {
                    currentName.number = item.value;
                    result.push(currentName);
                    currentName = {};
                    lastSequenceNumber = null;

                } else if (result.length > 0 
                            && !currentName.name 
                            && item.value
                            && item.idx - prevIdxEnd <= 3 // This is just next number.
                        ) {
                    // Copy last scripture with another verse number.

                    currentName.name = result[result.length - 1].name;
                    currentName.number = item.value;
                    result.push(currentName);
                    currentName = {};
                    lastSequenceNumber = null;

                } else {

                    // Skip sequences.
                    var skipSequence = false;
                    if (item.value && /\d+/.test(item.value)) {
                        var intValue = parseInt(item.value)
                        if (!lastSequenceNumber && intValue === 1) {
                            // Start sequence.
                            lastSequenceNumber = intValue;
                            skipSequence = true;
                        } else if (lastSequenceNumber && (lastSequenceNumber + 1) === intValue) {
                            lastSequenceNumber = intValue;
                            skipSequence = true;
                        } else {
                            lastSequenceNumber = null;    
                        }
                    } else {
                        lastSequenceNumber = null;
                    }

                    if (!skipSequence) {
                        // console.log('---error scriptures', debug_counter++)
                        // console.log('---error scriptures', this.md)
                        // console.log('---error scriptures', item)
                        // console.log('---error scriptures', items)
                    }
                }

                if (item.value) {
                    // Store last number end position.
                    prevIdxEnd = item.idx + item.value.length;
                }
            });

            return result;
        }
    }

    getScripturesNubmers() {
        var re = /\d+(?:[\.–-]\d+)*/g;
        var match;
        var result = [];
        var lastIdx = 0;
        while (match = re.exec(this.md)) {
            var idx = this.words_str.indexOf(match[0].replace(/\D/g, ' '), lastIdx);
            result.push({
                idx: idx,
                value: match[0]
            });
            lastIdx = idx + match[0].length;
        }
        return result;
    }

    getScripturesNames() {
        var match_scriptures_lists = SCRIPTURES_MAP.map(scriptures_list => {
            return scriptures_list.filter(sm => { 
                return sm.set.intersection(this.words_set).size === sm.set.size 
            });
        }).filter(i => i.length);

        var result = [];

        if (match_scriptures_lists.length > 0) {

            match_scriptures_lists.forEach(m_list => {

                m_list.find(m => {
                    var idxs = getIndicesOf(this.words_str, m.id);
                    if (idxs.length === 0){
                        var shortcut = NAMES_SEARCH_SHORTCUTS[m.id];
                        if (typeof shortcut === 'string') {
                            idxs = getIndicesOf(this.words_str, shortcut);
                        } else if (Array.isArray(shortcut)){
                            shortcut.find(s => {
                                idxs = getIndicesOf(this.words_str, s);
                                return idxs.length > 0;
                            });
                        }
                    }
                    
                    if (idxs.length > 0) {
                        result.push({
                            idx: idxs[0],
                            name: m.text
                        });
                        return true;
                    }
                });

                
            });
        }

        return result;
    }

    getUsedScripturesWithNamesItems() {
        if (this.scripture_names_with_numbers?.length) {
            return this.scripture_names_with_numbers;
        }
    }

    getUsedScripturesNames() {
        if (this.scripture_names_with_numbers?.length) {
            return this.scripture_names_with_numbers.map(i => i.name);
        }
    }

    getUsedScripturesNamesWithNubmers() {
        if (this.scripture_names_with_numbers?.length) {
            return this.scripture_names_with_numbers.map(i => `${i.name} ${i.number}`);
        }
    }

    getScriptureName() {
        if (this.scripture_names_with_numbers?.length) {
            return this.scripture_names_with_numbers[0].name;
        }
    }

    getScriptureNameWithNumber() {
        if (this.scripture_names_with_numbers?.length) {
            return `${this.scripture_names_with_numbers[0].name} ${this.scripture_names_with_numbers[0].number}`;
        }
    }

    getMD() {
        var md = '';
    
        this.nodes.forEach(node => {
            switch(node.type) {
                case "footnote":
                case "p":
                    md += node.text  + '\n';
                    break;
                case "code":
                    md += '    ' + node.text  + '\n';
                    break;
                case "br":
                    md += '\n';
                    break;
            }
        });
    
        return md;
    }

    renderDebug() {
        return '# ' + this.nodes[0].id + '\n\n' + this.md;
    }
}

function analyzeFootnotes2()  {
    for(var i = 0; i < all_footnotes.length; i++) {
        var f1 = all_footnotes[i];
        if (f1.similar) {
            continue;
        }

        for(var j = i + 1; j < all_footnotes.length; j++) {
            var f2 = all_footnotes[j];
            if (f2.similar) {
                continue;
            }

            var ins = f1.words_set.intersection(f2.words_set);
            var f1p = ins.size / f1.words_set.size;
            var f2p = ins.size / f2.words_set.size;

            if (f1p > 0.5 && f2p > 0.5 && f1.words_set.size > 2 && f2.words_set.size > 2) {
                console.log('i', i, j, all_footnotes.length);
                console.log('=================', f1.words_set.size, f2.words_set.size, ins.size, f1p, f2p);
                // console.log('=================', f1.words_set, f2.words_set, ins);
                console.log(f1.md)
                console.log('----');
                console.log(f2.md);

                f2.similar = true;
            }
        }
    }
};

function getIndicesOf(str, searchStr) {
    var searchStrLen = searchStr.length;
    if (searchStrLen == 0) {
        return [];
    }
    var startIndex = 0, index, indices = [];
    while ((index = str.indexOf(searchStr, startIndex)) > -1) {
        indices.push(index);
        startIndex = index + searchStrLen;
    }
    return indices;
}


module.exports = {
    Footnote,
    analyzeFootnotes2,
    debug_dict: debug_not_found_dict
};
