const { relative, dirname } = require('path');

var SCRIPTURES = [
    {"шветашватара упанишад": "Шветашватара-упанишад"},
    {"бхакти расамрита синдху": "Бхакти-расамрита-синдху"},
    {"веданта сутра": "Веданта-сутра"},
    {"ману самхита": "Ману-самхита"},
    {"шримад бхагаватам": "Шримад-Бхагаватам"},

    {"бхагавад гита": "Бхагавад-гита",
        "бхагавад гиты": "Бхагавад-гита",
        "бхагавад гите": "Бхагавад-гита"},

    {"шрила бхактивинод тхакур шри шикшаштакам цикл песен": "Бхактивинод Тхакур, цикл песен: Шри Шикшаштакам"},
    {"всевышний господь шри чайтаньячандра шри шикшаштакам": "Шри Шикшаштакам"},

    {"гита говинда": "Шри Гита-Говинда"},
    {"риг веда": "Риг-веда"},
    {"брахма самхита": "Шри Брахма-самхита"},
    {"гита мала": "Гита-мала"},
    {"катха упанишад": "Катха-упанишад"},

    {"бхакти сандарбха": "Бхакти-сандарбха",
        "бхакти сандарбхе": "Бхакти-сандарбха"},

    {"таттва сандарбха": "Таттва-сандарбха"},
    {"бхагавад сандарбха": "Бхагавад-сандарбха"},
    {"хитопадеша": "Хитопадеша"},
    {"шад госвами аштака": "Шад-Госвами-аштака"},

    {"чайтанья чаритамрита антья": "«Шри Чайтанья-чаритамрита», Антья-лила",
        "чайтанья чаритамриты антья": "«Шри Чайтанья-чаритамрита», Антья-лила",
        "чайтанья чаритамриту антья": "«Шри Чайтанья-чаритамрита», Антья-лила",
        "чайтанья чаритамрите антья": "«Шри Чайтанья-чаритамрита», Антья-лила",
        "чайтанья чаритамрите антья": "«Шри Чайтанья-чаритамрита», Антья-лила"},

    {"чайтанья чаритамрита мадхья": "«Шри Чайтанья-чаритамрита», Мадхья-лила",
        "чайтанья чаритамрите мадхья": "«Шри Чайтанья-чаритамрита», Мадхья-лила",
        "чайтанья чаритамриты мадхья": "«Шри Чайтанья-чаритамрита», Мадхья-лила",
        "чайтанья чаритамриту мадхья": "«Шри Чайтанья-чаритамрита», Мадхья-лила"},

    {"чайтанья чаритамрита ади": "«Шри Чайтанья-чаритамрита», Ади-лила",
        "чайтанья чаритамрите ади": "«Шри Чайтанья-чаритамрита», Ади-лила",
        "чайтанья чаритамриты ади": "«Шри Чайтанья-чаритамрита», Ади-лила",
        "чайтанья чаритамриту ади": "«Шри Чайтанья-чаритамрита», Ади-лила"},
    
    {"поиск шри кришны": "Поиск Шри Кришны"},
    {"падьявали": "Падьявали"},
    {"гоптритве варана": "Гоптритве варана"},
    {"шаранагати": "Шаранагати"}, // 1
    {"вилапа кусуманджали": "Шри Вилапа-кусуманджали"},
    {"вилāпа кусумāн̃джали": "Шри Вилапа-кусуманджали"},
    {"шри кришнера аштоттара шата нама": "Шри Шри Кришнера аштоттара-шата-нама"},
    {"бхаджана рахасья вритти": "Бхаджана-рахасья-вритти"},
    {"према виварта": "Према-виварта"},
    {"падма пурана уттара": "«Падма-пурана», Уттара-кханда",
        "падма пураны уттара": "«Падма-пурана», Уттара-кханда"},
    {"према дхама дева стотрам": "Према-Дхама-Дева-стотрам"},
    {"гитамала ямуна бхававали": "«Гитамала», Ямуна-бхававали"},
    {"радха раса судха нидхи": "Радха-раса-судха-нидхи"},
    {"шри гуру парампара": "Шри Гуру-парампара"},

    {"чайтанья бхагавата мадхья": "«Шри Чайтанья Бхагавата», Мадхья-кханда",
        "чайтанья бхагаваты мадхья": "«Шри Чайтанья Бхагавата», Мадхья-кханда"},
    {"чайтанья бхагавата антья": "«Шри Чайтанья Бхагавата», Антья-кханда",
        "чайтанья бхагаваты антья": "«Шри Чайтанья Бхагавата», Антья-кханда"},
    {"чайтанья бхагавата ади": "«Шри Чайтанья Бхагавата», Ади-кханда",
        "чайтанья бхагаваты ади": "«Шри Чайтанья Бхагавата», Ади-кханда"},

    {"лалита аштака": "Шри Лалита-аштака"},
    {"шри дайита даса пранати панчакам": "Шри Дайита Даса Пранати Панчакам"},
    {"дайита дас дашакам": "Шри Шри Дайита Дас Дашакам"},
    {"прабхупада падма ставаках": "Шри Шри Прабхупада-падма Ставаках"},
    {"шриман нитьянанда двадашакам": "Шриман Нитьянанда Двадашакам"},
    {"нитай гунамани амара": "Нитай гунамани амара"},
    {"шримад бхактивинода вираха дашакам": "Шримад Бхактивинода-вираха Дашакам"},
    {"гитавали": "Гитавали"},
    {"прапанна дживанамритам": "Шри Шри Прапанна-дживанамритам"},
    // "прартхана": "Прартхана",
    {"сарвасва томара": "Сарвасва томара"},
    {"гитамахатмйам": "Гитамахатмйам"},
    {"гурваштака": "Шри Гурваштака"},
    {"ишопанишад": "Шри Ишопанишад"},
    {"прартханашрая чатурдашака": "Шри Прартханашрая-чатурдашака"},

    {"манах шикша": "Манах-шикша",
        "манах̣ ш́икш̣а̄": "Манах-шикша"},

    {"вайшнава ке": "Вайшнава ке"},
    {"мундака упанишад": "Мундака Упанишад"},
    {"таиттирия упанишад": "Таиттирия-упанишад"},
    {"махабхарата ади парва": "«Махабхарата», Ади-парва"},
    {"махабхарата удьога парва": "«Махабхарата», Удьога-парва"},

    {"махабхарата бхишма парва": "«Махабхараты», Бхишма-парва",
        "махабхараты бхишма парва": "«Махабхараты», Бхишма-парва"},
    
    {"махабхарата вана парва": "«Махабхараты», Вана-парва",
        "махабхараты вана парва": "«Махабхараты», Вана-парва"},
    
    {"анйа абхилаша чхади": "Анйа-абхилаша чхади",
        "анйа абхила̄ш̣а чха̄д̣и": "Анйа-абхилаша чхади"},

    {"джайва дхарма": "Джайва-дхарма",
        "джайва дхарме": "Джайва-дхарма"},

    {"хари бхакти виласа": "Хари-бхакти-виласа"},
    {"брихан нарадия пурана": "Брихан-нарадия-пурана"},
    {"катха упанишада": "Катха-Упанишада"},
    {"чхандогья упанишада": "Чхандогья-упанишада"},
    {"шветашватара упанишада": "Шветашватара-упанишада"},
    {"чайтанья чандрамрита": "Чайтанья-чандрамрита"},
    {"мукта чаритра": "Мукта Чаритра"},
    {"кальяна калпатару": "Кальяна-калпатару"},
    {"враджа виласа става": "Враджа-виласа-става"},
    {"шад госвами аштакам": "Шри Шад Госвами Аштакам"},
    {"кришна карнамрита": "Кришна-карнамрита"},

    {"брихад бхагаватамрита": "Брихад Бхагаватамрита",
        "брихад бхагаватамритам": "Брихад Бхагаватамрита"},
    
    {"намаштакам": "Намаштакам"},

    {"прартхана лаласа": "«Прартхана», Лаласа",
        "даинйа прартхана гити": "Даинйа Прартхана Гити",
        "шри прартхана": "Шри Прартхана"},

    {"шри дана кели чинтамани": "Шри Дана-кели Чинтамани"},
    {"шри лалита аштакам": "Шри Лалита-аштакам"},
    {"упадешамрита": "Шри Упадешамрита"},
    {"кабе муи вайшнава чинибо": "Кабе муи вайшнава чинибо"},
    {"шримад гауракишора намаскара дашакам": "Шри Шримад Гауракишора-намаскара Дашакам"},
    {"рупануга махатмья": "Шри рупануга-махатмья"},
    {"акродха парамананда": "Акродха парамананда"},
    {"джанама сапхала тара": "Джанама сапхала тара"},
    {"радхаштака": "Шри Радхаштака"},
    {"бхаджана лаласа": "Бхаджана-лаласа"},
    {"чайтаньяштака": "Шри Чайтаньяштака"},
    {"кали гхора тимире": "Кали-гхора тимире"},
    {"ригведа": "Ригведа"},
    {"кабе шри чаитанйа море корибена дойа": "Кабе шри чаитанйа море корибена дойа"},
    {"гауранга каруна коро": "Гауранга каруна коро"},
    {"нитай пада камала": "Нитай-Пада-Камала"},
    {"рагхувамша": "Рагхувамша"},

    {"вишну пурана": "Вишну-пурана",
        "вишну пураны": "Вишну-пурана",
        "виш̣н̣у пура̄н̣а": "Вишну-пурана"},

    {"мангалачарана": "Мангалачарана"},
    {"наваграха стотра": "Наваграха стотра"},
    {"нама санкиртан": "Нама-санкиртан"},
    {"слово хранителя преданности": "Слово Хранителя Преданности"},

    {"ачарья вандана": "Ачарья вандана",
        "а̄ча̄рйа вандана": "Ачарья вандана"},
    {"шри нама": "Шри Нама"},
    {"шри нама махатмья": "Шри Нама-Махатмья"},
    {"шуддха бхаката": "Шуддха-бхаката"},
    {"манаса дехо гехо": "Манаса дехо гехо"},
    {"саи кева сунаило шйама нама": "Саи, Кева Сунаило Шйама-нама"},
    {"даинья прапатти": "Даинья о прапатти"},  
    {"ману смрити": "Ману-смрити"},
    {"атма самарпане": "Атма-самарпане"},
    {"ш́рӣ кр̣ш̣н̣ера вим̇соттара ш́ата на̄ма": "Ш́рӣ Кр̣ш̣н̣ера Вим̇соттара-ш́ата-на̄ма"},
    {"чаураграганья пуруша аштака": "Шри Чаураграганья-пуруша-аштака"},
    {"радха бхаджана махима": "Шри Радха-бхаджана махима"},
    {"хари бхакти виласа прабхаса кханда": "«Хари-бхакти-виласа», Прабхаса-кханда"},
    {"пратхама йама садхана шраддха": "Пратхама-йама садхана - Шраддха"},
    {"таиттирийа упанишад": "Таиттирийа-упанишад"},
    {"према бхакти чандрика": "Шри Према-бхакти-чандрика"},

    {"тайттирия упанишад": "Тайттирия-упанишад",
        "чхандогья упанишад": "Чхандогья-упанишад"},

    // TOOD: find matches.
    {"лагху бхагаватамрите": "Лагху-бхагаватамрита",
        "лагху бхагаватамрита": "Лагху-бхагаватамрита"},

    {"видагдха мадхава": "Видагдха-мадхава"},
    {"шрингара бхеда пракарана": "«Уджджвала-ниламани», Шрингара-бхеда-пракарана"},
    {"мукунда мала стотра": "Мукунда-мала-стотра"},
    {"чайтанья чандродая натака": "Шри Чайтанья-чандродая-натака"},
    {"хари бхакти судходая": "Хари-бхакти-судходая"},
    {"бхакти анукула матра": "Бхакти-анукула-матра"},

    // TODO: not working.
    {"брихадараньяка-упанишада": "Брихадараньяка-упанишада"}

    // {"чайтанья бхагавата": "Чайтанья-Бхагавата"}


];

var NAMES_SEARCH_SHORTCUTS = {
    'даинья прапатти': 'даинья о прапатти',
    'чайтанья чаритамрите антья': ['антья лила', 'антья лиле'],
    'чайтанья бхагавата мадхья': ['мадхья лила', 'мадхья лиле'],
    'чайтанья чаритамриты мадхья': ['мадхья лила', 'мадхья лилы', 'мадхья лиле'],
    'чайтанья чаритамрита антья': ['антья лила', 'антья лиле', 'антья лилы'],
    'чайтанья чаритамриты ади': ['ади лила', 'ади лилы', 'ади лиле'],
    'чайтанья бхагаваты мадхья': ['мадхья кханды'],
    'чайтанья чаритамрита мадхья': ['мадхья лила', 'мадхья лиле'],
    'чайтанья чаритамрите мадхья': ['мадхья лила', 'мадхья лиле'],
    'чайтанья чаритамрите ади': ['ади лила', 'ади лиле'],
};

var SHLOKAS = [
    [
    '*мӯкам̇ кароти ва̄ча̄лам̇ пан̇гум̇ лан̇гхайате гирим / йат-кр̣па̄ там ахам̇ ванде ш́рӣ-гурум̇ дӣна-та̄ран̣ам*',
    '*мӯкам̇ каротива̄ча̄лам̇ пан̇гум̇ лан̇гхайатегирим / йат-кр̣па̄ там ахам̇ вандеш́рӣ-гурум̇ дӣна-та̄ран̣ам*',
    '*мӯкам̇ кароти ва̄ча̄лам̇, пан̇гум̇ лан̇гхайате гирим / йат-кр̣па̄ там ахам̇ ванде, ш́рӣ-гурум̇ дӣна-та̄ран̣ам*',
    "*мӯкам̇ кароти ва̄ча̄лам̇, пан̇гум̇ лан̇гхайате гирим / йат-кр̣па̄ там ахам̇ ванде, ш́рӣ-гурум̇ дӣна-та̄ран̣ам*",
    "*мӯкам̇ кароти ва̄ча̄лам̇, пан̇гум̇ лан̇гхайате гирим / йат-кр̣па̄ там ахам̇ ванде, ш́рӣ-гурум̇ дӣна-та̄ран̣ам*",
    "*мӯкам̇ кароти ва̄ча̄лам̇, пан̇гум̇ лан̇гхайате гирим / йат-кр̣па̄ там ахам̇ ванде, ш́рӣ-гурум̇ дӣна-та̄ран̣ам*",
    "*мӯкам̇ кароти ва̄ча̄лам̇, пан̇гум̇ лан̇гхайате гирим / йат-кр̣па̄ там ахам̇ ванде, ш́рӣ-гурум̇ дӣна-та̄ран̣ам*",
    "*мӯкам̇ кароти ва̄ча̄лам̇, пан̇гум̇ лан̇гхайате гирим / йат-кр̣па̄ там ахам̇ ванде, ш́рӣ-гурум̇ дӣна-та̄ран̣ам*",
    ],
    '*кр̣ш̣н̣а-анусандха̄на*',
    [
    '*ом аджнанад йади ва мохат прачйаветадхарешу йат, смаранадева тад-вишнох сампурнах сйадити шрутих / ом прийатам пундари-какшах сарва-йаджнешварохарих, тасминстуште джагат-туштам прините принитам джагат*',
    '*ом аджнанад йади ва мохат прачйаветадхарешу йат, смаранадева тад-вишнох сампурнах сйадити шрутих / ом прийатам пундари-какшах сарва-йаджнешварохарих, йасмин туш̣т̣е джагат туш̣т̣ам прӣн̣ӣте прӣн̣итам̇ джагат*',
    '*ом аджнанад йади ва мохат прачйаветадхарешу йат, смаранадева тад-вишнох сампурнах сйадити шрутих / ом прийатам пундари-какшах сарва-йаджнешварохарих, йасмин туш̣т̣е джагат туш̣т̣ам прӣн̣ӣте прӣн̣итам̇ джагат*',
    '*ом аджнанад йади ва мохат прачйаветадхарешу йат, смаранадева тад-вишнох сампурнах сйадити шрутих / ом прийатам пундари-какшах сарва-йаджнешварохарих, йасмин туш̣т̣е джагат туш̣т̣ам прӣн̣ӣте прӣн̣итам̇ джагат*',
    '*ом аджнанад йади ва мохат прачйаветадхарешу йат, смаранадева тад-вишнох сампурнах сйадити шрутих / ом прийатам пундари-какшах сарва-йаджнешварохарих, йасмин туште джагат туштам прините принитам джагат*',
    '*ом аджнанад йади ва мохат прачйаветадхарешу йат, смаранадева тад-вишнох сампурнах сйадити шрутих / ом прийатам пундари-какшах сарва-йаджнешварохарих, йасмин туште джагат туштам прините принитам джагат*',
    '*ом аджнанад йади ва мохат прачйаветадхарешу йат, смаранадева тад-вишнох сампурнах сйадити шрутих / ом прийатам пундари-какшах сарва-йаджнешварохарих, йасмин туште джагат туштам прините принитам джагат*',
    "*йасмин туш̣т̣е джагат туш̣т̣ам прӣн̣ӣте прӣн̣итам̇ джагат*",
    ],
    [
    '*ва̄н̃чха̄-калпатарубхйаш́’ ча кр̣па̄-синдхубхйа эва ча / патита̄на̄м̇ па̄ванебхйо ваиш̣н̣авебхйо намо намах̣*',
    "*ва̄н̃чха̄-калпатарубхйаш́' ча кр̣па̄-синдхубхйа эва ча / патита̄на̄м̇ па̄ванебхйо ваиш̣н̣авебхйо намо намах̣*",
    ],
    '*акхила-расамрита-муртих*',
    '*чето-дарпан̣а-ма̄рджанам̇ бхава-маха̄-да̄ва̄гни-нирва̄пан̣ам̇, ш́рейах̣-кайрава-чандрика̄-витаран̣ам̇ видйа̄-вадхӯ-джӣванам̇ / а̄нанда̄мбудхи-вардханам̇ прати-падам̇ пӯрн̣а̄мр̣та̄сва̄данам̇, сарва̄тма-снапанам̇ парам̇ виджайате ш́рӣ-кр̣ш̣н̣а-сан̇кӣрттанам*',
    '*сварупе сабара хайа голокете стхити*',
    [
    '*сакала чха̄д̣ийа̄ бха̄и ш́раддха̄девӣра гун̣а га̄и*',
    '*сакала чха̄д̣ийа̄ бха̄и ш́раддха̄девӣра гун̣а га̄и…*',
    ],
    [
    '*(йади) гаура на̄ хаита, табе ки хаита, кемане дхарита̄м де’ / према-раса-сӣма̄ ра̄дха̄ра махима̄, джагате джа̄на̄та ке?*',
    '*(йади) гаура на̄ хаита, табе ки хаита, кемане дхарита̄м де’ / ра̄дха̄ра махима̄ према-раса-сӣма̄, джагате джа̄на̄та ке?*',
    "*(йади) гаура на̄ хаита, табе ки хаита, кемане дхарита̄м де' / према-раса-сӣма̄ ра̄дха̄ра махима̄, джагате джа̄на̄та ке*",
    "*(йади) гаура на̄ хаита, табе ки хаита, кемане дхарита̄м де' / према-раса-сӣма̄ ра̄дха̄ра махима̄, джагате джа̄на̄та ке*",
    "*(йади) гаура на̄ хаита, табе ки хаита, кемане дхарита̄м де' / према-раса-сӣма̄ ра̄дха̄ра махима̄, джагате джа̄на̄та ке*",
    "*(йади) гаура на̄ хаита, табе ки хаита, кемане дхарита̄м де' / ра̄дха̄ра махима̄ према-раса-сӣма̄, джагате джа̄на̄та ке*",
    "*(йади) гаура на̄ хаита, табе ки хаита, кемане дхарита̄м де' / према-раса-сӣма̄ ра̄дха̄ра махима̄, джагате джа̄на̄та ке*",
    "*(йади) гаура на̄ хаита, табе ки хаита, кемане дхарита̄м де' / према-раса-сӣма̄ ра̄дха̄ра махима̄, джагате джа̄на̄та ке*",
    "*(йади) гаура на̄ хаита, табе ки хаита, кемане дхарита̄м де' / према-раса-сӣма̄ ра̄дха̄ра махима̄, джагате джа̄на̄та ке*",
    "*(йади) гаура на̄ хаита, табе ки хаита, кемане дхарита̄м де' / према-раса-сӣма̄ ра̄дха̄ра махима̄, джагате джа̄на̄та ке*",
    "*(йади) гаура на̄ хаита, табе ки хаита, кемане дхарита̄м де' / према-раса-сӣма̄ ра̄дха̄ра махима̄, джагате джа̄на̄та ке*",
    "*(йади) гаура на̄ хаита, табе ки хаита, кемане дхарита̄м де' / према-раса-сӣма̄ ра̄дха̄ра махима̄, джагате джа̄на̄та ке*",
    "*(йади) гаура на̄ хаита, табе ки хаита, кемане дхарита̄м де' / према-раса-сӣма̄ ра̄дха̄ра махима̄, джагате джа̄на̄та ке*",
    "*(йади) гаура на̄ хаита, табе ки хаита, кемане дхарита̄м де' / према-раса-сӣма̄ ра̄дха̄ра махима̄, джагате джа̄на̄та ке*",
    "*(йади) гаура на̄ хаита, табе ки хаита, кемане дхарита̄м де' / према-раса-сӣма̄ ра̄дха̄ра махима̄, джагате джа̄на̄та ке*",
    "*(йади) гаура на̄ хаита, табе ки хаита, кемане дхарита̄м де' / према-раса-сӣма̄ ра̄дха̄ра махима̄, джагате джа̄на̄та ке*",
    ],
    '*гаура-прабхох према-виласа-бхумау / нишкинчано бхакти-винода-нама*',
    [
    //'*ма̄талахариджанакӣрттанаран̇ге / пӯджалара̄га-патхагаурава-бхан̇ге*',
    '*ма̄тала хариджана кӣрттана ран̇ге / пӯджала ра̄га-патха гаурава-бхан̇ге*',
    "*ма̄тала хариджана кӣрттана ран̇ге / пӯджала ра̄га-патха гаурава-бхан̇ге*",
    "*ма̄тала хариджана кӣрттана ран̇ге / пӯджалара̄га-патхагаурава-бхан̇ге*"
    ],
    [
    '*асадху-санге бхай, кришна-нама нахи хайа / намакшарабахирайа бату нама кабхунайа*',
    '*асадху-санге бхай, кришна-нама нахи хайа / намакшара бахирайа бату нама кабху найа*',
    '*асадху-санге бхаи «кршна нама» нахи хайа / «намакшара» бахирайа бате нама кабху найа*',
    '*асадху-санге бхай, кришна-нама нахи хайа / «намакшара» бахирайа бате нама кабху найа*'
    ],
    [
    '*бхаджа гаура̄н̇га каха гаура̄н̇га, лаха гаура̄н̇гера на̄ма / йен джана гаура̄н̇га бхадже, сеи хайа а̄ма̄р пра̄н̣а*',
    '*бхаджа гаура̄н̇га каха гаура̄н̇га / лаха гаура̄н̇гера на̄ма / йе джана гаура̄н̇га бхадже / сеи хайа а̄ма̄р пра̄н̣а*',
    "*бхаджа гаура̄н̇га, каха гаура̄н̇га, лаха гаура̄н̇гера на̄ма / йен джана гаура̄н̇га бхадже, сеи хайа а̄ма̄р пра̄н̣а*",
    ],
    [
    '*бахиран̇ге сан̇ге каре на̄ма-сан̇кӣртана*',
    '*бахиран̇ге сан̇ге каре на̄ма-сан̇кӣртана / антаран̇га сан̇ге каре раса-а̄сва̄дана*',
    ],
    [
    '*бахубхир милитва йат киртанам тад эва санкиртанам*',
    '*бахубхир милитва йат киртанам*',
    ],
    '*йе ме бхакта-джанāх̣ пāртха на ме бхактāш́ ча те джанāх̣ / мад-бхактāнāм̇ ча йе бхактāс те ме бхакта-тамā матāх̣*',
    '*симха прасена мавадхит симхо джамбавата хатаха / шукумаарака маа родхишта тавахйеша сйамантака*',
    [
    '*ом̇ аджн̃а̄на-тимира̄ндхасйа джн̃а̄на̄н̃джана-ш́ала̄кайа̄ / чакш̣ур унмилитам̇ йена тасмаи ш́рӣ-гураве намах̣*',
    "*ом̇ аджн̃а̄на-тимира̄ндхасйа, джн̃а̄на̄н̃джана-ш́ала̄кайа̄ / чакш̣ур унмилитам̇ йена, тасмаи ш́рӣ-гураве намах̣*",
    ],
    '*харир эва сада̄ра̄дхйах̣ сарва-девеш́вареш́варах̣ / итаре брахма-рудра̄дйа̄ на̄ваджн̃ейа̄х̣ када̄чана*',
    '*адхах̣ кр̣там̇ атикра̄нтам̇ акш̣аджам̇ индрийа-джам̇ джн̃а̄нам̇ йена сах̣*',
    [
    '*раджа пашйати карнабхйам, дхийа пашйанти пандитах / пашух пашйанти гандхена, бхуте пашйанти барбарах*',
    "*раджа пашйати карнабхйам, ведаих пашйанти пандитах / пашух пашйанти гандхена, бхуте пашйанти барбарах*",
    ],
    [
    '*сата̄м̇ нинда̄ на̄мнах̣ парам апара̄дхам̇ витануте / йатах̣ кхйа̄тим̇ йа̄там̇ катхамусахате тад виграха̄м*',
    '*сата̄м̇ нинда̄ на̄мнах̣ парам*',
    ],
    '*сурарше вихита шастре харим уддишйа йа крийа / ива бхактир ити прокта йа бхактих пара бхавет*',
    '*на̄мно бала̄д йасйа хи па̄па-буддхир / на видйате тасйа йамаир хи ш́уддхих̣*',
    [
    '*ачиноти йах шастрартхам, ачаре стхапайатй апи / свайам ачарате йасма, ачарйас тена киртитах*',
    "*ачхиноти йах шастрартхам ачаре стапарат апи, сайам ачар джате йасмат ачарйа стена киртита / апани ачхари дхарма дживере шикхайа, апани на коиле дхарма шикхама наджайа*",
    ],
    '*два̄парӣйаир джанаир вишн̣ух̣ пан̃чара̄траис ту кевалаих̣ / калау ту на̄ма-ма̄трен̣а пӯджйате бхагава̄н харих̣*',
    '*эка кришна-наме джато папа харе / папи хайа тато папа карибаре наре*',
    [
    '*сварӯпе саба̄ра хайа, голокете стхити*',
    '*сварӯпе саба̄ра хайа голокете стхити*',
    "*сварӯпе саба̄ра хайа голокете стхити / ваикун̣т̣хе ваикун̣т̣ха на̄тха камала̄ра пати*",
    ],
    [
    '*никхила-бхувана-ма̄йа̄-чхинна-виччхинна-картрӣ, вибудха-бахула-мр̣гйа̄-мукти-моха̄нта-да̄трӣ / ш́итхилита-видхи-ра̄га̄ра̄дхйа-ра̄дхеш́а-дха̄нӣ, виласату хр̣ди нитйам̇ бхакти-сиддха̄нта-ва̄н̣ӣ*',
    "*никхила-бхувана-ма̄йа̄-чхинна-виччхинна-картрӣ, вибудха-бахула-мр̣гйа̄-мукти-моха̄нта-да̄трӣ / ш́итхилита-видхи-ра̄га̄ра̄дхйа-ра̄дхеш́а-дха̄нӣ, виласату хр̣ди нитйам̇ бхакти-сиддха̄нта-ва̄н̣ӣ*",
    '*никхила-бхувана-ма̄йа̄-чинна̄виччинна-картрӣ / вибудха-бахула-мр̣гйа̄-мукти-моханта-дха̄три*',
    "*никхила-бхувана-ма̄йа̄-чхинна-виччхинна-картрӣ\\\nвибудха-бахула-мр̣гйа̄-мукти-моха̄нта-да̄трӣ\\\nш́итхилита-видхи-ра̄га̄ра̄дхйа-ра̄дхеш́а-дха̄нӣ\\\nвиласату хр̣ди нитйам̇ бхакти-сиддха̄нта-ва̄н̣ӣ*",    
    ],
    '*бхвадес тат савитур варенйа / вихитам кшетраджна-севйартхакам*',
    '*гаятри муралишта-киртана-дханам / радха-падам дхимахи*',
    '*мийате анайа ити майа*',
    [
    '*асато ма̄ сад гама̄йа / та̄масо ма̄ джйотир гама̄йа / мр̣тйор ма̄ амр̣там гама̄йа*',
    "*асато ма̄ сад гама̄йа, та̄масо ма̄ джйотир гама̄йа, мр̣тйор ма̄ амр̣там гама̄йа*",
    ],
    '*говиндабхидха мандирашрита / падам хастастха ратнадиват / таттвам таттва видхуттама / кшититале йо даршайан чакратух*',
    '*ш́рӣ-сиддха̄нта-сарасватӣти видито гауд̣ӣйа-гурв-анвайе, бхато бха̄нурива прабха̄та-гагане йо гаура-сам̇кӣрттанаих̣ / ма̄йа̄ва̄да-тимин̇гилодара-гата̄н уддхр̣тйа джӣванима̄н, кр̣ш̣н̣а-према-судха̄бдхи-га̄хан̣а-сукхам̇ пра̄да̄т прабхум̇ там̇ бхадже*',
    '*«киран», «бинду», «кана»*',
    [
    '*ом̇ пӯрн̣ам адах̣ пӯрн̣ам идам̇ / пӯрн̣а̄т пӯрн̣ам удачйате*',
    '*ом̇ пӯрн̣ам адах̣ пӯрн̣ам идам̇, пӯрн̣а̄т пӯрн̣ам удачйате / пӯрн̣асйа пӯрн̣ам а̄да̄йа, пӯрн̣ам эва̄ваш́ишйате*',
    ],
    [
    '*гададхара митра-вара, шри сварупа дамодара, сада кала гаура-кришна ядже*',
    "*гададхара митра-вара, шри сварупа дамодара, сада кала гаура-кришна ядже / джагатера декхи' клеша, дхария бхикшука-веша, ахарахах кришна-нама бхадже // шри гаура иччхайя дуи, махима ки кава муи, апракрита паришада-катха / праката хайя севе, кришна-гаурабхинна-деве, апракашья катха йатха татха*",
    "*гададхара митра-вара, шри сварупа дамодара, сада кала гаура-кришна ядже, джагатера декхи' клеша, дхария бхикшука-веша, ахарахах кришна-нама бхадже / шри гаура иччхайя дуи, махима ки кава муи, апракрита паришада-катха, праката хайя севе, кришна-гаурабхинна-деве, апракашья катха йатха татха*",
    "*гададхара митра-вара, шри сварупа дамодара, сада кала гаура-кришна ядже\\\nджагатера декхи' клеша, дхария бхикшука-веша, ахарахах кришна-нама бхадже\\\nшри гаура иччхайя дуи, махима ки кава муи, апракрита паришада-катха\\\nпраката хайя севе, кришна-гаурабхинна-деве, апракашья катха йатха татха*",
    ],
    [
    '*ананда-тиртха нама сукха-майа-дхама йатир-джийат / самсарарнава-тараним йам иха джанах киртайанти будхах*',
    "*а̄нанда-тӣртха на̄ма̄ сукха-майа-дха̄ма̄ йатир-джӣйа̄т / самса̄ра̄рнава-таран̣им̇ йам иха джана̄х̣ кӣртайанти будха̄х̣*",
    ],
    '*джогйата-вичаре, кичху нахи паи, томара каруна — сара / каруна на хоиле, кандийа кандийа, прана на ракхибо ара*',
    '*гауде ганга-тате нава-враджа-навадвипа ту майапуре, шри чаитанйа-матха-пракаша-каваро дживаика-калйанадхих / шри сиддханта-сарасватити-видито гаудийа-гурванвайе, бхато бханурива прабхатагагане рупанугаих пуджитах*',
    '*девам̇ дивйа-танум̇ сучанда-ваданам̇-ба̄ла̄рка-чела̄н̃читам̇, са̄ндра̄нанда-пурам̇ сад-эка-варанам̇ ваира̄гйа-видйа̄мбудхим / ш́рӣ-сиддха̄нта-нидхим̇ субхакти-ласитам̇ са̄расвата̄на̄м варам̇, ванде там̇ ш́убхадам̇ мад-эка-ш́аран̣ам̇ нйа̄сӣш́варам̇ ш́рӣдхарам*',
    '*дживе-дойа наме-ручи вайшнава-севана / иха чхара дхарма нахи шуна санатана*',
    [
    '*нарахари-ади кори’ чамара дхулайа / санджайа-мукунда-васу-гхоша-ади гайа*',
    "*нарахари-ади кори' чамара дхулайа / санджайа-мукунда-васу-гхоша-ади гайа*",
    ],
    [
    '*гхриштам гхриштам пунарапи пунах чанданам чаругандхам, чиннам чиннам пунарапи пунах сваду чаивекшу-кандам / дагдхам дагдхам пунарапи пунах канчанам канта варнам, прананте’пи пракрити-викритир джайате ноттаманам*',
    "*гхриштам гхриштам пунарапи пунах чанданам чаругандхам, чиннам чиннам пунарапи пунах сваду чаивекшу-кандам / дагдхам дагдхам пунарапи пунах канчанам канта варнам, прананте'пи пракрити-викритир джайате ноттаманам*",
    ],
    '*ваишнавера-пада-дхули тахе мора снана, келитарпана мора ваишнавера нама / ваишнавера уччхишта тахе мора маноништха, ваишнавера намете улласа*',
    '*ванде ‘хам̇ ш́рӣ-гурох̣ ш́рӣ-йута-пада-камалам̇ ш́рӣ-гурӯн ваиш̣н̣ава̄м̇ш́ ча, ш́рӣ-рӯпам̇ са̄граджа̄там̇ саха-ган̣а-рагхуна̄тха̄нвитам̇ там̇ са-джӣвам / са̄дваитам̇ са̄вадхӯтам̇ париджана-сахитам̇ кр̣ш̣н̣а-чаитанйа-девам̇, ш́рӣ-ра̄дха̄-кр̣ш̣н̣а-па̄да̄н саха-ган̣а-лалита̄-ш́рӣ-виш́а̄кха̄нвита̄м̇ш́ ча*',
    '*апра̄рабдха-пхалам̇ па̄пам̇, кӯт̣ам̇ бӣджам̇ пхалонмукхам / крамен̣аива пралӣйета, вишн̣у-бхакти-рата̄тмана̄м*',
    [
    '*джаладжа̄ навалакш̣а̄н̣и стха̄вара̄ лакш̣а-вим̇ш́атих̣ / кр̣тайо рудра-сан̇кхьяка̄х̣ пакш̣ин̣а̄м̇ даш́а-лакш̣акам / трим̇ш́ал-лакш̣а̄н̣и паш́авах̣ чатур лакш̣а̄н̣и ма̄нуш̣а̄х̣*',
    "*джаладжа̄ навалакш̣а̄н̣и, стха̄вара̄ лакш̣а-вим̇ш́атих̣, кр̣тайо рудра-сан̇кхьяка̄х̣, пакш̣ин̣а̄м̇ даш́а-лакш̣акам, трим̇ш́ал-лакш̣а̄н̣и паш́авах̣, чатур лакш̣а̄н̣и ма̄нуш̣а̄х̣*",
    ],
    [
    '*твам гопика вришаравес танайантике ’си, сева-адхикарини гуро ниджа-пада-падме / дасйам прадайа куру мам враджа-канане шри, радха-ангхри-севана-расе сукхиним сукхабдхау*',
    "*твам̇ гопика̄ вр̣ш̣а-равес танайа̄нтике 'си, сева̄дхика̄рин̣и гуро ниджа-па̄да-падме / да̄сйам̇ прада̄йа куру ма̄м̇ враджа-ка̄нане ш́рӣ, ра̄дха̄н̇гхри-севана-расе сукхинӣм̇ сукха̄бдхе*",
    ],
    [
    '*а̄рджавам̇ бра̄хман̣е са̄кш̣а̄т ш́ӯдро ’на̄рджава-лакш̣ан̣ах̣ / гаутамас тв ити виджн̃а̄йа сатйака̄мам упа̄найат*',
    "*а̄рджавам̇ бра̄хман̣е са̄кш̣а̄т, ш́ӯдро 'на̄рджава-лакш̣ан̣ах̣ / гаутамас тв ити виджн̃а̄йа, сатйака̄мам упа̄найат*",
    "*а̄рджавам̇ бра̄хман̣е са̄кш̣а̄т, ш́ӯдро 'на̄рджава-лакш̣ан̣ах̣ / гаутамас тв ити виджн̃а̄йа, сатйака̄мам упа̄найат*",
    ],
    '*aндхи бхута чакшу йара вишайа дхулите кемане се пара-таттва паибе декхите*',
    [
    '*гаятри-мантра: ом бхур бхувах свах тат савитур вареньям / бхарго девасья дхимахи дхийо йо нах прачодаят.*',
    '*ом бхур бхувах сваха*'
    ],
    [
    '*да̄модара-рати-вардхана-веш́е / хари-ниш̣кут̣а-вр̣инда̄-випинеш́е*',
    "*ра̄дхе джайа джайа ма̄дхава-дайите гокула-тарун̣ӣ-ман̣д̣ала-махите, да̄модара-рати-вардхана-веш́е хари-ниш̣кут̣а-вр̣нда̄-випинеш́е / вр̣ш̣абха̄нӯдадхи-нава-ш́аш́и-лекхе лалита̄-сакхи гун̣а-рамита-виш́а̄кхе, карун̣а̄м̇ куру майи карун̣а̄-бхарите санака-сана̄тана-варн̣ита-чарите*",
    ],
    '*бхагаван бхаджанийа-сарва-сад-гуна вишишта*',
    '*андхи бхута чакшу йара вишайа дхулите кемане се пара-таттва паибе декхите*',
    '*смара-гарала-кханданам, мама шираси манданам, дехи пада-паллавам ударам*',
    "*тйаджет экам̇ куласй' артхе, гра̄масй' а̄ртхе кулам̇ тйаджет / гра̄мам̇ йанападасй' артхе, хи а̄тма артхе пр̣тхивӣм̇ тйаджет*",
    "*ан̣оран̣ӣйа̄н махато махӣйа̄-на̄тма̄ гуха̄йа̄м̇ нихито'сйа джантох̣ / тамакратух̣ паш́йати вӣташ́око, дха̄тух̣ праса̄да̄нмахима̄намӣш́ам*",
    '*чакш̣у-да̄на дила̄ джеи, джанме джанме прабху сеи, дивйа-джн̃а̄на хр̣де прока̄ш́ито / према-бхакти джа̄ха̄ хоите, авидйа̄ вина̄ш́а джа̄те, веде га̄йа джа̄̐ха̄ра чарито*',
    '*валохалам̇ джагаттам̇ на̄тха, на̄ме вала сарасватӣ / валабйаласйа гаралам̇ ким̇, на̄ ханта калеварам*',
    "*томара кин̇кора, а̄пане джа̄нибо, '«гуру»-абхима̄на тйаджи' / тома̄ра уччхиш̣т̣ха, пада-джала-рен̣у, сада̄ ниш̣капат̣е бхаджи*",
    "*'нидже среш̣т̣ха джа̄ни', уччхиш̣т̣ха̄ди да̄не, ха'бе абхима̄на бха̄ра / та̄и ш́иш̣йа тава, тха̄кийа̄ сарвада̄, на̄ лоибо пӯджа̄ ка̄'ра*",
    '*найведйам джагадишасйа, анна-панадикан ча джат / бхакшйабхакшйа-вичараш ча, насти тад бхакшане двиджах*',
    "*гаура-према-раса̄рн̣аве, се таран̇ге джеба̄ д̣убе, се ра̄дха̄-ма̄бхава-антаран̇га / гр̣хе ва̄ ванете тха̄ке, 'ха̄ гаура̄н̇га' бо'ле д̣а̄ке, нароттама ма̄ге та̄ра сан̇га*",
    "*шри-радха-прана-бандхош чарана-камалайох кеша-шешадй-агамйа, йа садхйа према-сева враджа-чарита-параир гадха-лаулйаика-лабхйа / са сйат прапта йайа там пратхайитум адхуна манасим асйа севам, бхавйам рагадхва-пантхаир враджам ану чаритам наитйикам тасйа науми*",
    "*калау пратхама-сандхйа̄йа̄м̇ хари-на̄ма-прада̄йаках̣, бхавиш̣йати навадвӣпе ш́ачӣ-гарбхе джана̄рданах̣ / джӣва-ниста̄ран̣а̄ртха̄йа на̄ма-виста̄ран̣а̄йа ча, йо хи кр̣ш̣н̣ах̣ са чаитанйо манаса̄ бха̄ти сарвада̄*",
    [
    "*гаура̄н̇га болийа̄, на̄ гену галийа̄, кемоне дхорину де / ва̄судева хийа̄, па̄ш̣а̄н̣а дийа̄, кемоне гад̣ийа̄че*",
    "*гаура̄н̇га болийа̄, на̄ гену галийа̄, кемоне дхорину де / ва̄судева хийа̄, па̄ш̣а̄н̣а дийа̄, кемоне гад̣ийа̄че*",
    ],
    "*йат паш́йати, тат тв анура̄га̄тиш́айена*",
    "*ка̄ма кр̣ш̣н̣а-карма̄рпан̣е кродха бхакта-двеш́и-джане, лобха са̄дху-сан̇ге хари-катха̄ / моха иш̣т̣а-ла̄бха-бине мада кр̣ш̣н̣а-гун̣а-га̄не, ниджӯкта корибо джатха̄ татха̄*",
    [
    "*рӯпа ла̄ги а̄н̇кхи джхуре гун̣е мана бхор, прати ан̇га ла̄ги ка̄нде прати ан̇га мор / хийа̄р параш́а ла̄ги хийа̄ мор ка̄нде, пара̄н̣а путули ха̄й тхир на̄хи ва̄нде*",
    "*рӯпа ла̄ги а̄н̇кхи джхуре гун̣е мана бхор, прати ан̇га ла̄ги ка̄нде прати ан̇га мор / хийа̄р параш́а ла̄ги хийа̄ мор ка̄нде, пара̄н̣а путули ха̄й тхир на̄хи ва̄нде*",
    ],
    "*йасмин виджн̃а̄те сарвам эвам виджн̃а̄там бхавати / йасмин пра̄пте сарвам идам̇ пра̄птам̇ бхавати*",
    "*т̣ха̄кура-ваиш̣н̣ава-пада, аванӣра сусампада, ш́уно бха̄и! хоийа эка мана / а̄ш́ройа лоийа̄ бхадже, та̄ре кр̣ш̣н̣а на̄хи тйадже, а̄ро саба море ака̄ран̣а*",
    "*атраива таттва-виджнанам джнатавйам сататам будхаих / шакти-шактимато бхедо настй эва параматматмани*",
    "*дух̣кха-рӯпо 'пи сам̇са̄ро буддхи-пӯрвам ава̄пйате / йатха̄ свапне ш́ираш́ чхедам̇ свайам̇ кр̣тва̄тмано ваш́ах̣ // тато дух̣кхам ава̄пйета татха̄ джа̄гарито 'пи ту / джа̄нанн апй а̄тмано дух̣кхам аваш́ас ту правартате*",
    "*кришна таба пунйа хабе бхаи э-пунйа корибе джабе / радхарани кхуси хабе дхрува ати боли тома таи*",
    "*а̄тмa-сиддха-са̄вa лӣла̄-пӯрнa-саукхйа-лакш̣анaм̇, сва̄нубха̄вa-мaтта-нр̣тйа-кӣртана̄тмa-вaнт̣анaм / aдвaйаикa-лакш̣йа-пӯрн̣a-таттвa-тат-пара̄тпарам̇, прeмa-дха̄мa-дeвaм эвa нaуми гаура-сундарам*",
    "*ниламбходхи-тате сада сва-вираха-кшeпанвитам бандхавaм*",
    "*тр̣н̣а̄д апи сунӣчена, тарор апи сахиш̣н̣уна̄ / ама̄нина̄ ма̄надена кӣртанӣйах̣ сада̄ харих*",
    "*а̄ш́лиш̣йа ва̄ па̄да-рата̄м̇ пинаш̣т̣у ма̄м, адарш́ана̄н марма-хата̄м̇ кароту ва̄ / йатха̄ татха̄ ва̄ видатха̄ту лампат̣о, мат-пра̄н̣а-на̄тхас ту са эва напа̄рах̣*",
    "*джӣвера 'сварӯпа' хайа — кр̣ш̣н̣ера 'нитйа-да̄са' / кр̣ш̣н̣ера 'тат̣астха̄-ш́акти' 'бхеда̄бхеда прака̄ш́а'*",
    "*парахамса-варам парамартха-патим*",
    "*джн̃а̄не прайа̄сам удапа̄сйа наманта эва, джӣванти сан-мукхарита̄м̇ бхавадӣйа-ва̄рта̄м*",
    "*ка̄ршн̣а̄на̄м адхика̄ра̄нурӯпа̄ севаива бхаджана̄нукӯла̄- / кр̣шн̣ети йасйа гири там̇ манаса̄дрийета / дӣкша̄сти чет пран̣атибхиш́ ча бхаджантам ӣш́ам / ш́уш́рӯшайа̄ бхаджана-виджн̃ам ананйам анйа- / нинда̄ди-ш́ӯнйа-хр̣дам ӣпсита-сан̇га-лабдхйа̄*",
    "*джайати джайати намананда-рупам мурарер, вирамита-ниджа-дхармма-дхйана-пуджади джатнам / катхам апи сакридаттам муктидам пранинам джат, парамам амритам экам дживанам бхушанам ме*",
    [
    "*сим̇хах̣ прасенам авадхӣт сим̇хо джа̄мбавата̄ хата̄х̣ / сукума̄рака ма̄ родӣс тава хй еш̣а сйамантаках̣*",
    "*сим̇хах̣ прасенам авадхӣт сим̇хо джа̄мбавата̄ хата̄х̣ / сукума̄рака ма̄ родӣс тава хй еш̣а сйамантаках̣*",
    ],
    [
    "*а̄ра̄дхйо бхагава̄н враджеш́а-танайа тад-дха̄ма вр̣нда̄ванам, рамйа̄ ка̄чид упа̄сана̄ враджа-вадхӯ-варген̣а йа̄ калпита̄ / ш́рӣмад-бха̄гаватам̇ прама̄н̣ам-амалам̇ према̄ пумартхо маха̄н, ш́рӣ-чаитанйа маха̄прабхур-матам-идам̇ татра̄даро нах̣ парах̣*",
    "*а̄ра̄дхйо бхагава̄н враджеш́а-танайа тад-дха̄ма вр̣нда̄ванам, рамйа̄ ка̄чид упа̄сана̄ враджа-вадхӯ-варген̣а йа̄ калпита̄ / ш́рӣмад-бха̄гаватам̇ прама̄н̣ам-амалам̇ према̄ пумартхо маха̄н, ш́рӣ-чаитанйа маха̄прабхур-матам-идам̇ татра̄даро нах̣ парах̣*",
    ],
    [
    "*арччйе виш̣н̣ау ш̇ила̄-дхӣр гуруш̣у нара-матир ваиш̣н̣аве джа̄ти-буддхир, виш̣н̣ор ва̄ ваиш̣н̣ава̄на̄м кали-мала-матхане па̄да-тӣртхе 'мбу-буддхих̣ / ш̇рӣ-виш̣н̣ор-на̄мни-мантре сакала-калуш̣а-хе ш̇абда-са̄ма̄нйа-буддхир, виш̣н̣ау сарввеш̇вареш̇е тад-итара-сама-дхӣр йасйа ва̄ на̄ракӣ сах̣*",
    "*арччйе виш̣н̣ау ш̇ила̄-дхӣр гуруш̣у нара-матир ваиш̣н̣аве джа̄ти-буддхир, виш̣н̣ор ва̄ ваиш̣н̣ава̄на̄м кали-мала-матхане па̄да-тӣртхе 'мбу-буддхих̣ / ш̇рӣ-виш̣н̣ор-на̄мни-мантре сакала-калуш̣а-хе ш̇абда-са̄ма̄нйа-буддхир, виш̣н̣ау сарввеш̇вареш̇е тад-итара-сама-дхӣр йасйа ва̄ на̄ракӣ сах̣*",
    "*арччйе виш̣н̣ау ш̇ила̄-дхӣр гуруш̣у нара-матир ваиш̣н̣аве джа̄ти-буддхир, виш̣н̣ор ва̄ ваиш̣н̣ава̄на̄м кали-мала-матхане па̄да-тӣртхе 'мбу-буддхих̣ / ш̇рӣ-виш̣н̣ор-на̄мни-мантре сакала-калуш̣а-хе ш̇абда-са̄ма̄нйа-буддхир, виш̣н̣ау сарввеш̇вареш̇е тад-итара-сама-дхӣр йасйа ва̄ на̄ракӣ сах̣*",
    ],
    "*агха-ччхит смаран̣ам̇ виш̣н̣ор, бахв-а̄йа̄сена са̄дхйате / ош̣т̣ха-спандана-ма̄трен̣а, кӣртанам̇ ту тато варам*",
    [
    "*паш́у-пакш̣ӣ хойе тха̄ки сварге ба̄ ниройе / таба бхакти раху бхактивинода-хр̣дойе*",
    "*паш́у-пакш̣ӣ хойе тха̄ки сварге ба̄ ниройе / таба бхакти раху бхактивинода-хр̣дойе*",
    ],
    "*антах шакта бахих шайва, сабхаям вайшнава матах / нана-рупа-дхарах каула, вичаранти махи-тале*",
    "*дведха хи бхагавата-сампрадая-правриттих. экатах санкшепатах шри-нараянад брахма-нарадади-дварена. аньятас ту вистаратах шешат санат-кумара-санкхьяя-нади-дварена*",
    "*ка̄ма кр̣ш̣н̣а-карма̄рпан̣е кродха бхакта-двеш́и-джане, лобха са̄дху-сан̇ге хари-катха̄ / моха иш̣т̣а-ла̄бха-бине мада кр̣ш̣н̣а-гун̣а-га̄не, ниджӯкта корибо джатха̄ татха̄*",
    [
    "*ш́рӣман-мадхва-мате харих̣ паратамах̣ сатйам̇ джагат таттвато, бхедо джӣва-ган̣а̄ харер анучара̄ ничочча-бха̄вам̇ гатах̣ / муктир наиджа-сукха̄нубхӯтир амала̄ бхактиш́ ча тат-са̄дханам, хй акша̄ди-тритайам̇ прама̄н̣ам акхила̄мна̄йаика-ведйо харих̣*",
    "*ш́рӣман-мадхва-мате харих̣ паратамах̣ сатйам̇ джагат таттвато, бхедо джӣва-ган̣а̄ харер анучара̄ ничочча-бха̄вам̇ гатах̣ / муктир наиджа-сукха̄нубхӯтир амала̄ бхактиш́ ча тат-са̄дханам, хй акша̄ди-тритайам̇ прама̄н̣ам акхила̄мна̄йаика-ведйо харих̣*",
    "*ш́рӣман-мадхва-мате харих̣ паратамах̣ сатйам̇ джагат таттвато, бхедо джӣва-ган̣а̄ харер анучара̄ ничочча-бха̄вам̇ гатах̣ / муктир наиджа-сукха̄нубхӯтир амала̄ бхактиш́ ча тат-са̄дханам, хй акша̄ди-тритайам̇ прама̄н̣ам акхила̄мна̄йаика-ведйо харих̣*",
    ],
    [
    "*шри мадхвах праха вишнум паратамам акхиламнайа ведйам ча чишвам, сатйам бхедам ча дживам хари-чарана-джушас тартамйамш ча тешам / мокшам вишнв-ангхри-лабхам тад-амала-бхаджанам тасйа хетум праманам, пратйакшади трйам чети упадишати харих кришна-чайтанйа чандрах*",
    "*шри мадхвах праха вишнум паратамам акхиламнайа ведйам ча чишвам, сатйам бхедам ча дживам хари-чарана-джушас тартамйамш ча тешам / мокшам вишнв-ангхри-лабхам тад-амала-бхаджанам тасйа хетум праманам, пратйакшади трйам чети упадишати харих кришна-чайтанйа чандрах*",
    "*шри мадхвах праха вишнум паратамам акхиламнайа ведйам ча чишвам, сатйам бхедам ча дживам хари-чарана-джушас тартамйамш ча тешам / мокшам вишнв-ангхри-лабхам тад-амала-бхаджанам тасйа хетум праманам, пратйакшади трйам чети упадишати харих кришна-чайтанйа чандрах*",
    "*шри мадхвах праха вишнум паратамам акхиламнайа ведйам ча чишвам, сатйам бхедам ча дживам хари-чарана-джушас тартамйамш ча тешам / мокшам вишнв-ангхри-лабхам тад-амала-бхаджанам тасйа хетум праманам, пратйакшади трйам чети упадишати харих кришна-чайтанйа чандрах*",
    ],
    "*а̄ха̄ра-нидра̄-бхайа-маитхунам̇ ча, са̄ма̄нйам̇ этад паш́убхир нара̄н̣а̄м / дхармо хи тешам адхико вишешо, дхармена хинах пашубхих саманах*",
    "*сарватра кришнера мурти каре джхаламала, се декхите пайа йанра анкхи нирамала / андхибхута чакшу йара вишайа дхулите, ки-рупе се пара-таттва паибе декхите*",
    "*бхава-вирин̃чира, ва̄н̃чхита дже према, джагате пхелило д̣ха̄ли / ка̄нга̄ле па̄ийа̄, кха̄-ила на̄чийа, ба̄джа̄ийа карата̄ли*",
    "*радха-кришна прана мор дживане маране / море ракхи' мари' сукхе тхакука ду' джоне*",
    "*гурор гуро ме парамо гурус твам̇, варен̣йа! гаура̄н̇га-ган̣а̄граган̣йе / прасӣда бхр̣тйе дайита̄ш́рите те, намо намо гаура-киш́ора тубхйам*",
    "*квачид-враджа̄ран̣йа-вивикта-ва̄сӣ, хр̣ди враджа-двандва-рахо-вила̄сӣ / бахир вира̄гӣ тв авадхӯта-веш̣ӣ, намо намо гаура-киш́ора тубхйам*",
    "*квачит пунар гаура-вана̄нтача̄рӣ, сура̄пага̄-тӣра-раджо-виха̄рӣ / павитра-каупӣна-каран̇ка-дха̄рӣ, намо намо гаура-киш́ора тубхйам*",
    "*йад ачйута катха̄ лапах̣, карн̣а пийуша варджитах̣ / таддинам̇ дурдинам̇ манйе, мегха-чханнам̇ дурдинам*",
    "*ом дхйейах̣ сада̄ савитр̣-ман̣д̣ала-мадхйа-вартӣ на̄ра̄йан̣ах̣ сарасиджа̄сана-саннивиш̣т̣ах̣ / кейӯрава̄на макаракун̇д̣алава̄на кӣрӣт̣и ха̄рӣ хиран̣майа-вапух̣ дхр̣та-ш́ан̇кха-чакрах̣*",
    "*голокера према-дхана, хари-на̄ма-сан̇кӣртана, рати на̄ джанмило кене та̄йа / сам̇са̄ра-биш̣а̄нале, диба̄-ниш́и хийа̄ джwале, джура̄ите на̄ коину упа̄йа*",
    "*йа идам̇ виш́вам̇ вйа̄пноти ити виш̣н̣ух̣*",
    "*шлока дхену правакшйами, йад актам йанти котибхих / брахма сатйам, джаган митхйа, джива брахмаива на парах*",
    "*бхута-прета-вада лайе гаура-преме мисаийе, ниджа бхоге гадила гауранга / «джада-бхоге гаурахари гадаичхи ниджа хари», бале, «тора хаби сангопанга»*",
    "*ш́рӣмач-чаитанйа-са̄расвата-мат̣хавара-удгӣта-кӣртир-джайа-ш́рӣм̇, бибхрат самбха̄ти ган̇га̄-тат̣а-никата-навадвӣпа-кола̄дри-ра̄дже / йатра ш́рӣ-гаура-са̄расвата-мата-нирата̄-гаура-га̄тха̄-гр̣н̣анти, нитйам-рӯпа̄нуга ш́рӣ-кр̣тамати-гуру-гаура̄н̇га-ра̄дха̄-джита̄ш́а̄*",
    "*ка̄те ка̄нта̄-дхана-гатачинта̄, ва̄тула ким̇ тава на̄сти нийанта̄ / трийаджати саджджанасам̇ гатирека̄, бхавати бхава̄рн̣ава-таран̣е наука̄*",
    "*гаурангаика-гатир-враджа-астрита-матих шри-гаура-дхама-стхитих, саччхастраика-вритих кушанга-виратир-душтха-вйатха-нишкритих / шри-рупаика-ратих санатана-натих шри-джива-теджас-татих, шри-сиддханта-сарасвати виджайате гаудийа-гоштхи-ратих*",
    "*ванде бхактивинодам̇ ш́рӣ-гаура-ш́акти-сварӯпакам / бхакти-ш́а̄страджн̃а-самра̄джам̇ ра̄дха̄-раса-судха̄-нидхим*",
    "*гаура-враджа̄ш́рита̄ш́еш̣аир ваиш̣н̣аваир вандйа-виграхам / джаганна̄тха-прабхум̇ ванде према̄бдхим̇ вр̣ддха-ваиш̣н̣авам*",
    "*сваирачарабдхи-санмагнам, дживан гаурангхри-панкадже / удхритйа шаранапатер, махатмйам самабодхайат*",
    "*дойа̄ коро ш́рӣ-а̄ча̄рйа прабху ш́рӣнива̄са / ра̄мачандра-сан̇га ма̄ге нароттама да̄са*",
    "*джага̄и ма̄дха̄и хаите мун̃и се па̄пиш̣т̣ха / пурӣш̣ера кӣт̣а хаите мун̃и се лагхишт̣ха*",
    "*махапрабху шри чаитанйа — радха-кришна нахи анйа, рупануга джанера дживана*",
    "*говинда̄бхидхам индира̄ш́рита-падам̇ хастастха-ратна̄диват / таттвам̇ таттвавид-уттамау кш̣ити-тале йау дарш́айа̄н̃ чакрату*",
    "*'радха-кришна' бол бол боло ре собаи, (эи) шикха дийа, саб надийа, пхирчхе нече' гаура-нитаи / (мичхе) майар боше, джаччхо бхесе', кхаччхо хабудубу бхаи*",
    `*нандера нандана, доши нахе кона джана, гокуле ке а̄че хена на̄рӣ\\\nха̄йа ха̄ма абха̄гини, хаину кула каланикни, кахиле найане бахе ба̄ри\\\nанйера йе апайаша, кахите шуните доша, а̄че хена видхира видха̄на\\\nа̄ма̄ра каланка йата, га̄на каре бха̄гавата, пхука̄ри веда̄ди пура̄на\\\nкеха га̄йа дхире дхире, кеха га̄йа уччхасваре, кеха ва̄ йапайе мане мане\\\nэмана шунехи катха̄, а̄ма̄ра адбхута катха̄, гуру дейа шишера шраване\\\nа̄ма̄ра катха̄йа рабе йе, а̄ма̄ра мата хабе ше, башӣйа̄ кахину вр̣нда̄ване\\\nвасу ра̄ма̄нанда шукхе, вачана на̄ спхуре мукхе, дха̄ра̄ бахе йугала найане*`,
    "*гурудеве, враджа-ване, враджа-бхуми-васи джане, шуддха-бхакте, ара випра-гане\\\nишта-мантре, хари-наме, йугала бхаджана каме, кара рати апурвва йатане\\\nдхари мана чаране томара-джанийачхи эбе сара, кришна-бхакти вина ара,\\\nнахи гхуче дживера самсара, кармма, джнана, тапах, йога, сакалаи та кармма-бхога,\\\nкармма чхадаите кеха наре, сакала чхадийа бхаи, шраддха-девира гуна гаи,\\\nйанра крипа бхакти дите паре, чхади' дамбха анукшана, смара ашта-таттва мана,\\\nкара тахе нишкапата рати, сеи рати прартханайа, шри-даса-госвами пайа,\\\nэ бхакативинода каре нати*",
    "*ахам брахма̄сми*"
];

// Шри Нама
// *хр̣дайа хаите бале, джихва̄ра агрета чале, ш́абда-рӯпе на̄че анукш̣ан̣а / кан̣т̣хе мора бхан̇ге свара, ан̇га ка̄̐пе тхара тхара, стхира хаите на̄ па̄ре чаран̣а* — «Святое Имя исходит из моего сердца, появляется на языке и постоянно танцует на нем в форме трансцендентного звука. Дыхание прерывается, тело бьет сильная дрожь, а ноги передвигаются сами по себе» (Шрила Бхактивинод Тхакур, «Шаранагати», «Шри Нама-махатмья», 2).

var SCRIPTURES_MAP = SCRIPTURES.map(obj => {
    return Object.keys(obj).map(id => {
        return {
            id: id,
            text: obj[id],
            set: new Set(id.split(' '))
        };
    });
});

var debug_counter = 1;
var debug_not_found_dict = {};

// Helper function for Set intersection (for compatibility)
function setIntersection(setA, setB) {
    if (setA.intersection) {
        return setA.intersection(setB);
    }
    const intersection = new Set();
    for (const elem of setB) {
        if (setA.has(elem)) {
            intersection.add(elem);
        }
    }
    return intersection;
}

class Footnote {

    constructor(documentFile, nodes) {
        this.documentFile = documentFile;
        this.nodes = nodes;

        // console.log(nodes)

        this.md = this.getMD();

        // Lower case without punctuation to search matches position.
        var words = this.md.toLowerCase().split(/[\u00A0 \?,\.\-"\(\)\[\]\/»«\*\n‑–—]+/);
        this.words_str = words.join(' ');

        // Revemo digints for words set
        this.words_set = new Set(this.words_str.split(/[ \d]+/).filter(i => !!i && i.length > 1));

        var scriptureNumbers = this.getScripturesNubmers();
        if (scriptureNumbers.length > 0) {
            this.scripture_numbers = scriptureNumbers;
        }
        var scriptureNames = this.getScripturesNames();
        if (scriptureNames.length > 0) {
            this.scripture_names = scriptureNames;
        }

        this.scripture_names_with_numbers = this.getScripturesNameWithNumber();

        if (!this.scripture_names_with_numbers || this.scripture_names_with_numbers.length === 0) {
            var shloka_result = this.getScriptureShloka();
            if (shloka_result) {
                var { item_type, text } = shloka_result;
                if (item_type === 'shloka') {
                    this.shloka = text;
                } else if (item_type === 'term') {
                    this.term = text;
                }
            } else {
                
            }
        }

        documentFile.factory.addFootnote(this);
    }

    getScripturesNameWithNumber() {
        if (this.scripture_names && this.scripture_numbers) {

            var items = [...this.scripture_names, ...this.scripture_numbers];

            items.sort((a, b) => a.idx - b.idx);

            var result = [];
            var currentName = {};
            var prevIdxEnd = 0;
            var lastSequenceNumber; // Skip 1, 2, 3, 4.
            items.forEach(item => {
                if ((result.length === 0 // Skip first names without numbers.
                    || !currentName.name) && item.name) {
                    currentName.name = item.name;
                    lastSequenceNumber = null;

                } else if (currentName.name && item.value) {
                    currentName.number = item.value;
                    result.push(currentName);
                    currentName = {};
                    lastSequenceNumber = null;

                } else if (result.length > 0 
                            && !currentName.name 
                            && item.value
                            && item.idx - prevIdxEnd <= 3 // This is just next number.
                        ) {
                    // Copy last scripture with another verse number.

                    currentName.name = result[result.length - 1].name;
                    currentName.number = item.value;
                    result.push(currentName);
                    currentName = {};
                    lastSequenceNumber = null;

                } else {

                    // Skip sequences.
                    var skipSequence = false;
                    if (item.value && /\d+/.test(item.value)) {
                        var intValue = parseInt(item.value)
                        if (!lastSequenceNumber && intValue === 1) {
                            // Start sequence.
                            lastSequenceNumber = intValue;
                            skipSequence = true;
                        } else if (lastSequenceNumber && (lastSequenceNumber + 1) === intValue) {
                            lastSequenceNumber = intValue;
                            skipSequence = true;
                        } else {
                            lastSequenceNumber = null;    
                        }
                    } else {
                        lastSequenceNumber = null;
                    }

                    // if (!skipSequence) {
                    //     console.log('---error scriptures', debug_counter++)
                    //     console.log('---error scriptures', this.md)
                    //     console.log('---error scriptures', item)
                    //     console.log('---error scriptures', items)
                    // }
                }

                if (item.value) {
                    // Store last number end position.
                    prevIdxEnd = item.idx + item.value.length;
                }
            });

            return result;
        }
    }

    getScripturesNubmers() {
        // Replace URLs/links with spaces of the same length to preserve
        // character positions, so numbers inside them are not matched.
        // e.g. [http://sanga108.blogspot.com/2013/08/blog-post_16.html](http://sanga108.blogspot.com/2013/08/blog-post_16.html)
        // e.g. https://example.com/path/2013/08/post_16.html
        var mdSanitized = this.md.replace(
            /\[[^\]]*\]\([^\)]*\)|https?:\/\/\S+/g,
            m => ' '.repeat(m.length)
        );

        var re = /\d+(?:[\.–-]\d+)*/g;
        var match;
        var result = [];
        var lastIdx = 0;
        while (match = re.exec(mdSanitized)) {
            var idx = this.words_str.indexOf(match[0].replace(/\D/g, ' '), lastIdx);
            result.push({
                idx: idx,
                value: match[0]
            });
            lastIdx = idx + match[0].length;
        }
        return result;
    }

    getScripturesNames() {
        var match_scriptures_lists = SCRIPTURES_MAP.map(scriptures_list => {
            return scriptures_list.filter(sm => { 
                return setIntersection(sm.set, this.words_set).size === sm.set.size 
            });
        }).filter(i => i.length);

        var result = [];

        if (match_scriptures_lists.length > 0) {

            match_scriptures_lists.forEach(m_list => {

                m_list.find(m => {
                    var idxs = getIndicesOf(this.words_str, m.id);
                    if (idxs.length === 0){
                        var shortcut = NAMES_SEARCH_SHORTCUTS[m.id];
                        if (typeof shortcut === 'string') {
                            idxs = getIndicesOf(this.words_str, shortcut);
                        } else if (Array.isArray(shortcut)){
                            shortcut.find(s => {
                                idxs = getIndicesOf(this.words_str, s);
                                return idxs.length > 0;
                            });
                        }
                    }
                    
                    if (idxs.length > 0) {
                        idxs.forEach(idx => {
                            result.push({
                                idx: idx,
                                name: m.text
                            });
                        });
                        return true;
                    }
                });

                
            });
        }

        return result;
    }

    getScriptureShloka() {
        var m = this.md.trim().match(/^\*[^\*]+\*/);
        if (m) {
            var shloka = m[0].toLowerCase();
            var found = SHLOKAS.find(s => {
                if (Array.isArray(s)) {
                    return s.find(sub => shloka === sub);
                } else {
                    if (shloka === s) {
                        return true;
                    }
                }
            });
            if (found) {
                if (Array.isArray(found)) {
                    return {
                        item_type: 'shloka',
                        text: found[0]
                    };
                } else {
                    return {
                        item_type: 'shloka',
                        text: found
                    };
                }
            } else {
                if (shloka.split(' ').length === 1) {
                    return {
                        item_type: 'term',
                        text: shloka
                    };
                } else {
                    console.log('Not found shloka:', JSON.stringify(shloka))
                }
            }
        } else {

        }
    }

    getUsedScripturesWithNamesItems() {
        if (this.scripture_names_with_numbers?.length) {
            return this.scripture_names_with_numbers;
        }
    }

    getUsedScripturesNames() {
        if (this.scripture_names_with_numbers?.length) {
            return this.scripture_names_with_numbers.map(i => i.name);
        }
    }

    getUsedScripturesNamesWithNubmers() {
        if (this.scripture_names_with_numbers?.length) {
            return this.scripture_names_with_numbers.map(i => `${i.name} ${i.number}`);
        }
    }

    getScriptureName() {
        if (this.scripture_names_with_numbers?.length) {
            return this.scripture_names_with_numbers[0].name;
        }
    }

    getScriptureNameWithNumber() {
        if (this.scripture_names_with_numbers?.length) {
            return `${this.scripture_names_with_numbers[0].name} ${this.scripture_names_with_numbers[0].number}`;
        }
    }

    getMD() {
        var md = '';
    
        this.nodes.forEach(node => {
            switch(node.type) {
                case "footnote":
                case "p":
                    md += node.text  + '\n';
                    break;
                case "code":
                    md += '    ' + node.text  + '\n';
                    break;
                case "br":
                    md += '\n';
                    break;
            }
        });
    
        return md;
    }

    renderDebug() {
        return '# ' + this.nodes[0].id + '\n\n' + this.md;
    }

    renderDebugJson() {
        return {
            name: this.nodes[0].id,
            title: this.file?.title,
            text: this.md
        };
    }

    renderWithLink() {
        var md = `[^${ this.nodes[0].id }]:`;
        var first_line = true;

        // console.log(this.nodes)  

        if (this.file) {
            var base = dirname(this.documentFile.filename);
            // console.log(base)
            // console.log(this.file.getFullFilename())
            // console.log(relative(base, this.file.getFullFilename()))
            // console.log('----')
            var url = relative(base, this.file.getFullFilename());
            var title = this.file.title || this.shloka || this.term;
            md += ` [${ title }](${ url })\n\n`;
        } else {

            var note_md = '';

            this.nodes.forEach(node => {
                switch(node.type) {
                    case "footnote":
                    case "p":
                        if (first_line) {
                            if (node.text) {
                                note_md += ' ' + node.text + '\n';
                            } else {
                                note_md += '\n';
                            }
                            first_line = false;
                        } else {
                            note_md += '    ' + node.text  + '\n';
                        }
                        break;
                    case "code":
                        note_md += '        ' + node.text  + '\n';
                        break;
                    case "br":
                        note_md += '\n';
                        break;
                }
            });

            // console.log('Rendering footnote without file link:');
            // console.log(this.documentFile.filename);
            // console.log(note_md);
            md += note_md;
        }

        // console.log('------')
        // console.log(md)
        // console.log('------')

        return md;
    }
}

function getIndicesOf(str, searchStr) {
    var searchStrLen = searchStr.length;
    if (searchStrLen == 0) {
        return [];
    }
    var startIndex = 0, index, indices = [];
    while ((index = str.indexOf(searchStr, startIndex)) > -1) {
        indices.push(index);
        startIndex = index + searchStrLen;
    }
    return indices;
}


module.exports = {
    Footnote
};
